[Survived] StringLiteral
src/domain/exceptions/active-directory.exceptions.ts:12:17
 export class AdLookupException extends Error {
   constructor(reason: string) {
     super(`Active Directory lookup failed: ${reason}`);
-    this.name = 'AdLookupException';
+    this.name = "";
     Object.setPrototypeOf(this, AdLookupException.prototype);
   }
