[Survived] StringLiteral
src/domain/exceptions/price-change.exceptions.ts:4:17
 export class MinimumPriceViolationError extends Error {
   constructor(requestedPrice: number) {
     super(`Requested price ${requestedPrice} is below the minimum allowed price of 150`);
-    this.name = 'MinimumPriceViolationError';
+    this.name = "";
   }
 }

[Survived] StringLiteral
src/domain/exceptions/price-change.exceptions.ts:10:11
 
 export class InvalidPriceError extends Error {
   constructor() {
-    super('original_price cannot be 0 (division by zero)');
+    super("");
     this.name = 'InvalidPriceError';
   }
