[Killed] EqualityOperator
src/infrastructure/logging/pino-logger.adapter.ts:14:20
 
 function resolveLogLevel(): string {
   const envLevel = process.env.LOG_LEVEL;
-  if (!envLevel || envLevel.trim() === '') return 'info';
+  if (!envLevel || envLevel.trim() !== '') return 'info';
   const normalized = envLevel.toLowerCase().trim();
   if ((VALID_LOG_LEVELS as readonly string[]).includes(normalized)) return normalized;
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) debug messages are emitted when LOG_LEVEL=debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] MethodExpression
src/infrastructure/logging/pino-logger.adapter.ts:14:20
 
 function resolveLogLevel(): string {
   const envLevel = process.env.LOG_LEVEL;
-  if (!envLevel || envLevel.trim() === '') return 'info';
+  if (!envLevel || envLevel === '') return 'info';
   const normalized = envLevel.toLowerCase().trim();
   if ((VALID_LOG_LEVELS as readonly string[]).includes(normalized)) return normalized;

[Killed] MethodExpression
src/infrastructure/logging/pino-logger.adapter.ts:15:22
 function resolveLogLevel(): string {
   const envLevel = process.env.LOG_LEVEL;
   if (!envLevel || envLevel.trim() === '') return 'info';
-  const normalized = envLevel.toLowerCase().trim();
+  const normalized = envLevel.toUpperCase().trim();
   if ((VALID_LOG_LEVELS as readonly string[]).includes(normalized)) return normalized;
   // Invalid level falls back to info
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) debug messages are emitted when LOG_LEVEL=debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] MethodExpression
src/infrastructure/logging/pino-logger.adapter.ts:15:22
 function resolveLogLevel(): string {
   const envLevel = process.env.LOG_LEVEL;
   if (!envLevel || envLevel.trim() === '') return 'info';
-  const normalized = envLevel.toLowerCase().trim();
+  const normalized = envLevel.toLowerCase();
   if ((VALID_LOG_LEVELS as readonly string[]).includes(normalized)) return normalized;
   // Invalid level falls back to info

[Killed] ConditionalExpression
src/infrastructure/logging/pino-logger.adapter.ts:16:7
   const envLevel = process.env.LOG_LEVEL;
   if (!envLevel || envLevel.trim() === '') return 'info';
   const normalized = envLevel.toLowerCase().trim();
-  if ((VALID_LOG_LEVELS as readonly string[]).includes(normalized)) return normalized;
+  if (false) return normalized;
   // Invalid level falls back to info
   return 'info';
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) debug messages are emitted when LOG_LEVEL=debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/infrastructure/logging/pino-logger.adapter.ts:16:7
   const envLevel = process.env.LOG_LEVEL;
   if (!envLevel || envLevel.trim() === '') return 'info';
   const normalized = envLevel.toLowerCase().trim();
-  if ((VALID_LOG_LEVELS as readonly string[]).includes(normalized)) return normalized;
+  if (true) return normalized;
   // Invalid level falls back to info
   return 'info';
killedBy: PinoLoggerAdapter — log level configuration (US-04) Invalid LOG_LEVEL fallback (Test 14) falls back to info when LOG_LEVEL is invalid
statusReason: Error: default level:verbose must be included in custom levels

[Killed] ObjectLiteral
src/infrastructure/logging/pino-logger.adapter.ts:32:32
     // so tests can spy on process.stdout.write (pino v10 uses sonic-boom
     // internally which bypasses process.stdout.write otherwise).
     // The callback must be called synchronously for pino to work correctly.
-    this.stream = new Writable({
-      write(chunk: Buffer, _encoding: string, callback: (error?: Error | null) => void) {
-        process.stdout.write(chunk);
-        callback();
-      },
-    });
+    this.stream = new Writable({});
 
     this.pino = pino(
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) debug messages are emitted when LOG_LEVEL=debug
statusReason: Error: The _write() method is not implemented

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:33:89
     // internally which bypasses process.stdout.write otherwise).
     // The callback must be called synchronously for pino to work correctly.
     this.stream = new Writable({
-      write(chunk: Buffer, _encoding: string, callback: (error?: Error | null) => void) {
-        process.stdout.write(chunk);
-        callback();
-      },
+      write(chunk: Buffer, _encoding: string, callback: (error?: Error | null) => void) {},
     });
 
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) debug messages are emitted when LOG_LEVEL=debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
src/infrastructure/logging/pino-logger.adapter.ts:46:22
         messageKey: 'message',
         base: { service: serviceName },
         timestamp: () => `,"timestamp":"${new Date().toISOString()}"`,
-        serializers: {
-          err: pino.stdSerializers.err,
-        },
+        serializers: {},
       },
       this.stream,

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:54:49
     );
   }
 
-  setCorrelationId(correlationId: string): void {
-    const store = this.als.getStore();
-    if (store) {
-      store.correlationId = correlationId;
-    } else {
-      this.als.enterWith({ correlationId });
-    }
-  }
+  setCorrelationId(correlationId: string): void {}
 
   info(message: string, context?: Record<string, unknown>): void {
killedBy: PinoLoggerAdapter (US-01) correlation_id propagation (Test 3) setCorrelationId() causes subsequent logs to include correlation_id
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "correlation_id"
Received path: []

Received value: {"level": 30, "message": "request processed", "name": "test-service", "service": "test-service", "timestamp": "2026-06-11T22:48:19.954Z"}

[NoCoverage] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:56:16
 
   setCorrelationId(correlationId: string): void {
     const store = this.als.getStore();
-    if (store) {
-      store.correlationId = correlationId;
-    } else {
+    if (store) {} else {
       this.als.enterWith({ correlationId });
     }

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:58:12
     const store = this.als.getStore();
     if (store) {
       store.correlationId = correlationId;
-    } else {
-      this.als.enterWith({ correlationId });
-    }
+    } else {}
   }
 
killedBy: PinoLoggerAdapter (US-01) correlation_id propagation (Test 3) setCorrelationId() causes subsequent logs to include correlation_id
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "correlation_id"
Received path: []

Received value: {"level": 30, "message": "request processed", "name": "test-service", "service": "test-service", "timestamp": "2026-06-11T22:48:20.993Z"}

[Killed] ObjectLiteral
src/infrastructure/logging/pino-logger.adapter.ts:59:26
     if (store) {
       store.correlationId = correlationId;
     } else {
-      this.als.enterWith({ correlationId });
+      this.als.enterWith({});
     }
   }
killedBy: PinoLoggerAdapter (US-01) correlation_id propagation (Test 3) setCorrelationId() causes subsequent logs to include correlation_id
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "correlation_id"
Received path: []

Received value: {"level": 30, "message": "request processed", "name": "test-service", "service": "test-service", "timestamp": "2026-06-11T22:48:21.538Z"}

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:63:66
     }
   }
 
-  info(message: string, context?: Record<string, unknown>): void {
-    this.pino.info(this.enrichContext(context), message);
-  }
+  info(message: string, context?: Record<string, unknown>): void {}
 
   warn(message: string, context?: Record<string, unknown>): void {
killedBy: PinoLoggerAdapter — log level configuration (US-04) Invalid LOG_LEVEL fallback (Test 14) still emits info messages when LOG_LEVEL is empty string
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:67:66
     this.pino.info(this.enrichContext(context), message);
   }
 
-  warn(message: string, context?: Record<string, unknown>): void {
-    this.pino.warn(this.enrichContext(context), message);
-  }
+  warn(message: string, context?: Record<string, unknown>): void {}
 
   error(message: string, error?: Error, context?: Record<string, unknown>): void {
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) warn messages are always emitted (warn >= info)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:71:82
     this.pino.warn(this.enrichContext(context), message);
   }
 
-  error(message: string, error?: Error, context?: Record<string, unknown>): void {
-    const enriched = this.enrichContext(context);
-    if (error) {
-      enriched.err = error;
-    }
-    this.pino.error(enriched, message);
-  }
+  error(message: string, error?: Error, context?: Record<string, unknown>): void {}
 
   debug(message: string, context?: Record<string, unknown>): void {
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) error messages are always emitted (error >= info)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:73:16
 
   error(message: string, error?: Error, context?: Record<string, unknown>): void {
     const enriched = this.enrichContext(context);
-    if (error) {
-      enriched.err = error;
-    }
+    if (error) {}
     this.pino.error(enriched, message);
   }
killedBy: PinoLoggerAdapter (US-01) JSON output — valid structure (Test 2) error() emits valid JSON with level 50 and error details
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "err"
Received path: []

Received value: {"level": 50, "message": "error message", "name": "test-service", "service": "test-service", "timestamp": "2026-06-11T22:48:22.933Z"}

[Killed] ConditionalExpression
src/infrastructure/logging/pino-logger.adapter.ts:73:9
 
   error(message: string, error?: Error, context?: Record<string, unknown>): void {
     const enriched = this.enrichContext(context);
-    if (error) {
+    if (false) {
       enriched.err = error;
     }
killedBy: PinoLoggerAdapter (US-01) JSON output — valid structure (Test 2) error() emits valid JSON with level 50 and error details
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "err"
Received path: []

Received value: {"level": 50, "message": "error message", "name": "test-service", "service": "test-service", "timestamp": "2026-06-11T22:48:23.460Z"}

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:79:67
     this.pino.error(enriched, message);
   }
 
-  debug(message: string, context?: Record<string, unknown>): void {
-    this.pino.debug(this.enrichContext(context), message);
-  }
+  debug(message: string, context?: Record<string, unknown>): void {}
 
   private enrichContext(context?: Record<string, unknown>): Record<string, unknown> {
killedBy: PinoLoggerAdapter — log level configuration (US-04) LOG_LEVEL env var (Test 13) debug messages are emitted when LOG_LEVEL=debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/infrastructure/logging/pino-logger.adapter.ts:84:43
   }
 
   private enrichContext(context?: Record<string, unknown>): Record<string, unknown> {
-    const base: Record<string, unknown> = { ...context };
+    const base: Record<string, unknown> = {};
 
     // Add correlation_id from AsyncLocalStorage if present
killedBy: PinoLoggerAdapter (US-01) correlation_id propagation (Test 3) context in info() merges with correlation_id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "store-1"
Received: undefined

[Killed] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:88:31
 
     // Add correlation_id from AsyncLocalStorage if present
     const store = this.als.getStore();
-    if (store?.correlationId) {
-      base.correlation_id = store.correlationId;
-    }
+    if (store?.correlationId) {}
 
     // Extract trace_id and span_id from active OTel span context
killedBy: PinoLoggerAdapter (US-01) correlation_id propagation (Test 3) setCorrelationId() causes subsequent logs to include correlation_id
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "correlation_id"
Received path: []

Received value: {"level": 30, "message": "request processed", "name": "test-service", "service": "test-service", "timestamp": "2026-06-11T22:48:23.882Z"}

[NoCoverage] BlockStatement
src/infrastructure/logging/pino-logger.adapter.ts:94:21
 
     // Extract trace_id and span_id from active OTel span context
     const activeSpan = trace.getActiveSpan();
-    if (activeSpan) {
-      const spanContext = activeSpan.spanContext();
-      base.trace_id = spanContext.traceId;
-      base.span_id = spanContext.spanId;
-    }
+    if (activeSpan) {}
 
     return base;
