[Survived] StringLiteral
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:18:76
   ) {
     this.kafka = new Kafka({
       clientId: config.get<string>('KAFKA_CLIENT_ID', 'authorization-service'),
-      brokers: config.get<string>('KAFKA_BROKERS', 'localhost:9092').split(','),
+      brokers: config.get<string>('KAFKA_BROKERS', 'localhost:9092').split(""),
     });
     this.logger = logger ?? {

[Survived] BlockStatement
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:37:33
     this.consumer = this.kafka.consumer({ groupId });
     await this.consumer.connect();
 
-    for (const topic of topics) {
-      await this.consumer.subscribe({ topic, fromBeginning: false });
-    }
+    for (const topic of topics) {}
 
     await this.consumer.run({

[Survived] BooleanLiteral
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:38:61
     await this.consumer.connect();
 
     for (const topic of topics) {
-      await this.consumer.subscribe({ topic, fromBeginning: false });
+      await this.consumer.subscribe({ topic, fromBeginning: true });
     }
 

[Killed] BlockStatement
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:42:50
     }
 
     await this.consumer.run({
-      eachMessage: async ({ topic, message }) => {
-        if (!message.value) return;
-        try {
-          const payload = JSON.parse(message.value.toString()) as unknown;
-          const payloadObj = payload as Record<string, unknown>;
-
-          // Extract correlation_id from message payload and set on logger context
-          if (payloadObj?.correlation_id && typeof payloadObj.correlation_id === 'string') {
-            this.logger.setCorrelationId(payloadObj.correlation_id);
-          }
-
-          await handler(topic, payload);
-        } catch (err) {
-          this.logger.error(`Failed to process message from ${topic}`, err as Error);
-        }
-      },
+      eachMessage: async ({ topic, message }) => {},
     });
 
killedBy: KafkaConsumerAdapter — correlation_id extraction (US-03 — Test 9) handler receives correlation_id from Kafka message payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:44:13
     await this.consumer.run({
       eachMessage: async ({ topic, message }) => {
         if (!message.value) return;
-        try {
-          const payload = JSON.parse(message.value.toString()) as unknown;
-          const payloadObj = payload as Record<string, unknown>;
-
-          // Extract correlation_id from message payload and set on logger context
-          if (payloadObj?.correlation_id && typeof payloadObj.correlation_id === 'string') {
-            this.logger.setCorrelationId(payloadObj.correlation_id);
-          }
-
-          await handler(topic, payload);
-        } catch (err) {
+        try {} catch (err) {
           this.logger.error(`Failed to process message from ${topic}`, err as Error);
         }
killedBy: KafkaConsumerAdapter — correlation_id extraction (US-03 — Test 9) handler receives correlation_id from Kafka message payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] OptionalChaining
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:49:15
           const payloadObj = payload as Record<string, unknown>;
 
           // Extract correlation_id from message payload and set on logger context
-          if (payloadObj?.correlation_id && typeof payloadObj.correlation_id === 'string') {
+          if (payloadObj.correlation_id && typeof payloadObj.correlation_id === 'string') {
             this.logger.setCorrelationId(payloadObj.correlation_id);
           }

[Survived] BlockStatement
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:49:92
           const payloadObj = payload as Record<string, unknown>;
 
           // Extract correlation_id from message payload and set on logger context
-          if (payloadObj?.correlation_id && typeof payloadObj.correlation_id === 'string') {
-            this.logger.setCorrelationId(payloadObj.correlation_id);
-          }
+          if (payloadObj?.correlation_id && typeof payloadObj.correlation_id === 'string') {}
 
           await handler(topic, payload);

[NoCoverage] BlockStatement
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:54:23
           }
 
           await handler(topic, payload);
-        } catch (err) {
-          this.logger.error(`Failed to process message from ${topic}`, err as Error);
-        }
+        } catch (err) {}
       },
     });

[Survived] StringLiteral
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:60:59
       },
     });
 
-    this.logger.info(`Subscribed to topics: ${topics.join(', ')} (group: ${groupId})`);
+    this.logger.info(`Subscribed to topics: ${topics.join("")} (group: ${groupId})`);
   }
 

[NoCoverage] BlockStatement
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:63:37
     this.logger.info(`Subscribed to topics: ${topics.join(', ')} (group: ${groupId})`);
   }
 
-  async disconnect(): Promise<void> {
-    await this.consumer?.disconnect();
-  }
+  async disconnect(): Promise<void> {}
 
   async onModuleDestroy(): Promise<void> {

[NoCoverage] BlockStatement
infrastructure/messaging/kafka/kafka-consumer.adapter.ts:67:42
     await this.consumer?.disconnect();
   }
 
-  async onModuleDestroy(): Promise<void> {
-    await this.disconnect();
-  }
+  async onModuleDestroy(): Promise<void> {}
 }
 
