[Killed] BlockStatement
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:15:76
 
 function getTextMapSetter(): { set(carrier: Record<string, string>, key: string, value: string): void } {
   return {
-    set(carrier: Record<string, string>, key: string, value: string): void {
-      carrier[key] = value;
-    },
+    set(carrier: Record<string, string>, key: string, value: string): void {},
   };
 }
killedBy: KafkaPublisherAdapter — trace context (US-02 — Test 6) published message headers contain traceparent
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "traceparent"
Received array: ["tracestate"]

[Survived] BlockStatement
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:34:39
     this.producer = kafka.producer();
   }
 
-  async onModuleInit(): Promise<void> {
-    await this.producer.connect();
-    this.logger.log('Kafka producer connected');
-  }
+  async onModuleInit(): Promise<void> {}
 
   async publish(topic: string, message: unknown): Promise<void> {

[NoCoverage] BooleanLiteral
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:44:27
       // Build trace context headers: from active span or generate new
       const activeSpan = trace.getActiveSpan();
       let spanContext = activeSpan?.spanContext();
-      if (!spanContext || !spanContext.traceId) {
+      if (!spanContext || spanContext.traceId) {
         // No active span — generate new trace context
         const traceId = randomBytes(16).toString('hex');

[Survived] ConditionalExpression
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:44:11
       // Build trace context headers: from active span or generate new
       const activeSpan = trace.getActiveSpan();
       let spanContext = activeSpan?.spanContext();
-      if (!spanContext || !spanContext.traceId) {
+      if (true) {
         // No active span — generate new trace context
         const traceId = randomBytes(16).toString('hex');

[Killed] ConditionalExpression
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:55:11
       w3cPropagator.inject(ctx, carrier, getTextMapSetter());
 
       const headers: Record<string, string> = {};
-      if (carrier.traceparent) headers.traceparent = carrier.traceparent;
+      if (false) headers.traceparent = carrier.traceparent;
       if (carrier.tracestate) headers.tracestate = carrier.tracestate;
       // Ensure tracestate is always present for downstream consumers
killedBy: KafkaPublisherAdapter — trace context (US-02 — Test 6) published message headers contain traceparent
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "traceparent"
Received array: ["tracestate"]

[Survived] ConditionalExpression
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:55:11
       w3cPropagator.inject(ctx, carrier, getTextMapSetter());
 
       const headers: Record<string, string> = {};
-      if (carrier.traceparent) headers.traceparent = carrier.traceparent;
+      if (true) headers.traceparent = carrier.traceparent;
       if (carrier.tracestate) headers.tracestate = carrier.tracestate;
       // Ensure tracestate is always present for downstream consumers

[Survived] ConditionalExpression
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:56:11
 
       const headers: Record<string, string> = {};
       if (carrier.traceparent) headers.traceparent = carrier.traceparent;
-      if (carrier.tracestate) headers.tracestate = carrier.tracestate;
+      if (false) headers.tracestate = carrier.tracestate;
       // Ensure tracestate is always present for downstream consumers
       if (!headers.tracestate) {

[Survived] ConditionalExpression
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:56:11
 
       const headers: Record<string, string> = {};
       if (carrier.traceparent) headers.traceparent = carrier.traceparent;
-      if (carrier.tracestate) headers.tracestate = carrier.tracestate;
+      if (true) headers.tracestate = carrier.tracestate;
       // Ensure tracestate is always present for downstream consumers
       if (!headers.tracestate) {

[Killed] BlockStatement
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:58:32
       if (carrier.traceparent) headers.traceparent = carrier.traceparent;
       if (carrier.tracestate) headers.tracestate = carrier.tracestate;
       // Ensure tracestate is always present for downstream consumers
-      if (!headers.tracestate) {
-        headers.tracestate = '';
-      }
+      if (!headers.tracestate) {}
 
       await this.producer.send({
killedBy: KafkaPublisherAdapter — trace context (US-02 — Test 6) published message headers contain tracestate
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "tracestate"
Received array: ["traceparent"]

[Killed] ConditionalExpression
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:58:11
       if (carrier.traceparent) headers.traceparent = carrier.traceparent;
       if (carrier.tracestate) headers.tracestate = carrier.tracestate;
       // Ensure tracestate is always present for downstream consumers
-      if (!headers.tracestate) {
+      if (false) {
         headers.tracestate = '';
       }
killedBy: KafkaPublisherAdapter — trace context (US-02 — Test 6) published message headers contain tracestate
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "tracestate"
Received array: ["traceparent"]

[Survived] StringLiteral
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:59:30
       if (carrier.tracestate) headers.tracestate = carrier.tracestate;
       // Ensure tracestate is always present for downstream consumers
       if (!headers.tracestate) {
-        headers.tracestate = '';
+        headers.tracestate = "Stryker was here!";
       }
 

[Killed] ArrayDeclaration
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:64:19
 
       await this.producer.send({
         topic,
-        messages: [
-          {
-            value: JSON.stringify(message),
-            headers,
-          },
-        ],
+        messages: [],
       });
       this.logger.debug(`Published to ${topic}`);
killedBy: KafkaPublisherAdapter — trace context (US-02 — Test 6) producer.send() includes headers in the message
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] StringLiteral
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:71:25
           },
         ],
       });
-      this.logger.debug(`Published to ${topic}`);
+      this.logger.debug(``);
     } catch (error) {
       this.logger.error(

[NoCoverage] BlockStatement
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:72:21
         ],
       });
       this.logger.debug(`Published to ${topic}`);
-    } catch (error) {
-      this.logger.error(
-        `Failed to publish to Kafka topic ${topic}: ${error instanceof Error ? error.message : 'Unknown error'}`,
-      );
-      throw new Error(
-        `Kafka publish failed: ${error instanceof Error ? error.message : 'Unknown error'}`,
-      );
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:77:75
         `Failed to publish to Kafka topic ${topic}: ${error instanceof Error ? error.message : 'Unknown error'}`,
       );
       throw new Error(
-        `Kafka publish failed: ${error instanceof Error ? error.message : 'Unknown error'}`,
+        `Kafka publish failed: ${error instanceof Error ? error.message : ""}`,
       );
     }

[NoCoverage] BlockStatement
infrastructure/messaging/kafka/kafka-publisher.adapter.ts:82:37
     }
   }
 
-  async disconnect(): Promise<void> {
-    await this.producer.disconnect();
-  }
+  async disconnect(): Promise<void> {}
 
   async onModuleDestroy(): Promise<void> {
