[Survived] StringLiteral
src/infrastructure/outbox/outbox-publisher.service.ts:39:36
   ) {}
 
   private get batchSize(): number {
-    return this.config.get<number>('OUTBOX_BATCH_SIZE', 50);
+    return this.config.get<number>("", 50);
   }
 

[Killed] BlockStatement
src/infrastructure/outbox/outbox-publisher.service.ts:52:9
   async tick(): Promise<{ pending: number; published: number; failed: number; durationMs: number }> {
     const start = Date.now();
     let entries: OutboxEntry[] = [];
-    try {
-      entries = await this.outboxRepo.findPending(this.batchSize);
-    } catch (err) {
+    try {} catch (err) {
       this.logger.error(
         `findPending failed (DB down?): ${err instanceof Error ? err.message : 'unknown'}`,
killedBy: OutboxPublisherService tick() calls kafkaPublisher.publish for each pending entry with the same topic and payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<Number>

Number of calls: 0

[Survived] BlockStatement
src/infrastructure/outbox/outbox-publisher.service.ts:54:19
     let entries: OutboxEntry[] = [];
     try {
       entries = await this.outboxRepo.findPending(this.batchSize);
-    } catch (err) {
-      this.logger.error(
-        `findPending failed (DB down?): ${err instanceof Error ? err.message : 'unknown'}`,
-      );
-      return { pending: 0, published: 0, failed: 0, durationMs: Date.now() - start };
-    }
+    } catch (err) {}
 
     let published = 0;

[Survived] ArithmeticOperator
src/infrastructure/outbox/outbox-publisher.service.ts:58:65
       this.logger.error(
         `findPending failed (DB down?): ${err instanceof Error ? err.message : 'unknown'}`,
       );
-      return { pending: 0, published: 0, failed: 0, durationMs: Date.now() - start };
+      return { pending: 0, published: 0, failed: 0, durationMs: Date.now() + start };
     }
 

[Killed] BlockStatement
src/infrastructure/outbox/outbox-publisher.service.ts:63:34
 
     let published = 0;
     let failed = 0;
-    for (const entry of entries) {
-      try {
-        await this.publisher.publish(entry.topic, entry.payload);
-        await this.outboxRepo.markPublished(entry.id, new Date());
-        published++;
-        this.logger.debug(
-          `Published outbox entry ${entry.id} (correlation_id=${entry.correlationId}, topic=${entry.topic})`,
-        );
-      } catch (err) {
-        const error = err instanceof Error ? err : new Error(String(err));
-        try {
-          await this.outboxRepo.incrementAttempts(entry.id, error);
-        } catch (innerErr) {
-          this.logger.error(
-            `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : 'unknown'}`,
-          );
-        }
-        failed++;
-        this.logger.warn(
-          `Failed to publish outbox entry ${entry.id} (correlation_id=${entry.correlationId}, attempts=${entry.attempts + 1}): ${error.message}`,
-        );
-      }
-    }
+    for (const entry of entries) {}
 
     const durationMs = Date.now() - start;
killedBy: OutboxPublisherService tick() calls kafkaPublisher.publish for each pending entry with the same topic and payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/outbox/outbox-publisher.service.ts:64:11
     let published = 0;
     let failed = 0;
     for (const entry of entries) {
-      try {
-        await this.publisher.publish(entry.topic, entry.payload);
-        await this.outboxRepo.markPublished(entry.id, new Date());
-        published++;
-        this.logger.debug(
-          `Published outbox entry ${entry.id} (correlation_id=${entry.correlationId}, topic=${entry.topic})`,
-        );
-      } catch (err) {
+      try {} catch (err) {
         const error = err instanceof Error ? err : new Error(String(err));
         try {
killedBy: OutboxPublisherService tick() calls kafkaPublisher.publish for each pending entry with the same topic and payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] UpdateOperator
src/infrastructure/outbox/outbox-publisher.service.ts:67:9
       try {
         await this.publisher.publish(entry.topic, entry.payload);
         await this.outboxRepo.markPublished(entry.id, new Date());
-        published++;
+        published--;
         this.logger.debug(
           `Published outbox entry ${entry.id} (correlation_id=${entry.correlationId}, topic=${entry.topic})`,

[Killed] BlockStatement
src/infrastructure/outbox/outbox-publisher.service.ts:71:21
         this.logger.debug(
           `Published outbox entry ${entry.id} (correlation_id=${entry.correlationId}, topic=${entry.topic})`,
         );
-      } catch (err) {
-        const error = err instanceof Error ? err : new Error(String(err));
-        try {
-          await this.outboxRepo.incrementAttempts(entry.id, error);
-        } catch (innerErr) {
-          this.logger.error(
-            `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : 'unknown'}`,
-          );
-        }
-        failed++;
-        this.logger.warn(
-          `Failed to publish outbox entry ${entry.id} (correlation_id=${entry.correlationId}, attempts=${entry.attempts + 1}): ${error.message}`,
-        );
-      }
+      } catch (err) {}
     }
 
killedBy: OutboxPublisherService tick() increments attempts (and records lastError) when publish fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "99", [Error: Broker unavailable]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/outbox/outbox-publisher.service.ts:73:13
         );
       } catch (err) {
         const error = err instanceof Error ? err : new Error(String(err));
-        try {
-          await this.outboxRepo.incrementAttempts(entry.id, error);
-        } catch (innerErr) {
+        try {} catch (innerErr) {
           this.logger.error(
             `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : 'unknown'}`,
killedBy: OutboxPublisherService tick() increments attempts (and records lastError) when publish fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "99", [Error: Broker unavailable]

Number of calls: 0

[NoCoverage] BlockStatement
src/infrastructure/outbox/outbox-publisher.service.ts:75:28
         const error = err instanceof Error ? err : new Error(String(err));
         try {
           await this.outboxRepo.incrementAttempts(entry.id, error);
-        } catch (innerErr) {
-          this.logger.error(
-            `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : 'unknown'}`,
-          );
-        }
+        } catch (innerErr) {}
         failed++;
         this.logger.warn(

[NoCoverage] StringLiteral
src/infrastructure/outbox/outbox-publisher.service.ts:77:13
           await this.outboxRepo.incrementAttempts(entry.id, error);
         } catch (innerErr) {
           this.logger.error(
-            `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : 'unknown'}`,
+            ``,
           );
         }

[NoCoverage] StringLiteral
src/infrastructure/outbox/outbox-publisher.service.ts:77:109
           await this.outboxRepo.incrementAttempts(entry.id, error);
         } catch (innerErr) {
           this.logger.error(
-            `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : 'unknown'}`,
+            `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : ""}`,
           );
         }

[Survived] UpdateOperator
src/infrastructure/outbox/outbox-publisher.service.ts:80:9
             `Failed to increment attempts for ${entry.id}: ${innerErr instanceof Error ? innerErr.message : 'unknown'}`,
           );
         }
-        failed++;
+        failed--;
         this.logger.warn(
           `Failed to publish outbox entry ${entry.id} (correlation_id=${entry.correlationId}, attempts=${entry.attempts + 1}): ${error.message}`,

[Survived] ArithmeticOperator
src/infrastructure/outbox/outbox-publisher.service.ts:82:106
         }
         failed++;
         this.logger.warn(
-          `Failed to publish outbox entry ${entry.id} (correlation_id=${entry.correlationId}, attempts=${entry.attempts + 1}): ${error.message}`,
+          `Failed to publish outbox entry ${entry.id} (correlation_id=${entry.correlationId}, attempts=${entry.attempts - 1}): ${error.message}`,
         );
       }

[Survived] StringLiteral
src/infrastructure/outbox/outbox-publisher.service.ts:82:11
         }
         failed++;
         this.logger.warn(
-          `Failed to publish outbox entry ${entry.id} (correlation_id=${entry.correlationId}, attempts=${entry.attempts + 1}): ${error.message}`,
+          ``,
         );
       }

[Survived] ArithmeticOperator
src/infrastructure/outbox/outbox-publisher.service.ts:87:24
       }
     }
 
-    const durationMs = Date.now() - start;
+    const durationMs = Date.now() + start;
     this.logger.log(
       `Outbox tick: pending=${entries.length}, published=${published}, failed=${failed}, duration=${durationMs}ms`,
