[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:18:13
     correlationId: entity.correlationId,
     type: entity.type,
     status: entity.status,
-    amount: entity.amount ?? null,
+    amount: entity.amount && null,
     employeeId: entity.employeeId ?? null,
     productId: entity.productId ?? null,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:19:17
     type: entity.type,
     status: entity.status,
     amount: entity.amount ?? null,
-    employeeId: entity.employeeId ?? null,
+    employeeId: entity.employeeId && null,
     productId: entity.productId ?? null,
     originalPrice: entity.originalPrice ?? null,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:20:16
     status: entity.status,
     amount: entity.amount ?? null,
     employeeId: entity.employeeId ?? null,
-    productId: entity.productId ?? null,
+    productId: entity.productId && null,
     originalPrice: entity.originalPrice ?? null,
     requestedPrice: entity.requestedPrice ?? null,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:21:20
     amount: entity.amount ?? null,
     employeeId: entity.employeeId ?? null,
     productId: entity.productId ?? null,
-    originalPrice: entity.originalPrice ?? null,
+    originalPrice: entity.originalPrice && null,
     requestedPrice: entity.requestedPrice ?? null,
     resolvedBy: entity.resolvedBy ?? null,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:22:21
     employeeId: entity.employeeId ?? null,
     productId: entity.productId ?? null,
     originalPrice: entity.originalPrice ?? null,
-    requestedPrice: entity.requestedPrice ?? null,
+    requestedPrice: entity.requestedPrice && null,
     resolvedBy: entity.resolvedBy ?? null,
     resolvedAt: entity.resolvedAt ?? null,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:23:17
     productId: entity.productId ?? null,
     originalPrice: entity.originalPrice ?? null,
     requestedPrice: entity.requestedPrice ?? null,
-    resolvedBy: entity.resolvedBy ?? null,
+    resolvedBy: entity.resolvedBy && null,
     resolvedAt: entity.resolvedAt ?? null,
     createdAt: entity.createdAt,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:24:17
     originalPrice: entity.originalPrice ?? null,
     requestedPrice: entity.requestedPrice ?? null,
     resolvedBy: entity.resolvedBy ?? null,
-    resolvedAt: entity.resolvedAt ?? null,
+    resolvedAt: entity.resolvedAt && null,
     createdAt: entity.createdAt,
   };

[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:55:60
     this.db = provider.db;
   }
 
-  async save(request: AuthorizationRequest): Promise<void> {
-    const row = toInsert(request);
-    await this.db
-      .insert(authorizationRequests)
-      .values(row)
-      .onConflictDoUpdate({
-        target: authorizationRequests.id,
-        set: {
-          storeId: row.storeId,
-          posId: row.posId,
-          correlationId: row.correlationId,
-          type: row.type,
-          status: row.status,
-          amount: row.amount,
-          employeeId: row.employeeId,
-          productId: row.productId,
-          originalPrice: row.originalPrice,
-          requestedPrice: row.requestedPrice,
-          resolvedBy: row.resolvedBy,
-          resolvedAt: row.resolvedAt,
-        },
-      });
-  }
+  async save(request: AuthorizationRequest): Promise<void> {}
 
   async findById(id: string): Promise<AuthorizationRequest | null> {

[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:115:17
       eq(authorizationRequests.storeId, storeId),
       ne(authorizationRequests.status, AuthorizationStatus.PENDING),
     ];
-    if (status) {
-      conditions.push(eq(authorizationRequests.status, status));
-    }
+    if (status) {}
     if (supervisorId) {
       conditions.push(eq(authorizationRequests.resolvedBy, supervisorId));

[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle-authorization.repository.ts:118:23
     if (status) {
       conditions.push(eq(authorizationRequests.status, status));
     }
-    if (supervisorId) {
-      conditions.push(eq(authorizationRequests.resolvedBy, supervisorId));
-    }
+    if (supervisorId) {}
     const rows = await this.db
       .select()
