[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:28:9
 
 function toInsert(entry: OutboxEntry): OutboxInsert {
   return {
-    id: entry.id || undefined,
+    id: entry.id && undefined,
     correlationId: entry.correlationId,
     topic: entry.topic,

[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:47:49
     this.db = provider.db;
   }
 
-  async save(entry: OutboxEntry): Promise<void> {
-    await this.db.insert(outbox).values(toInsert(entry));
-  }
+  async save(entry: OutboxEntry): Promise<void> {}
 
   /**

[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:70:69
     return rows.map(toEntry);
   }
 
-  async markPublished(id: string, publishedAt: Date): Promise<void> {
-    await this.db
-      .update(outbox)
-      .set({ status: 'PUBLISHED', publishedAt })
-      .where(eq(outbox.id, id));
-  }
+  async markPublished(id: string, publishedAt: Date): Promise<void> {}
 
   async incrementAttempts(id: string, error: Error): Promise<void> {

[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:77:68
       .where(eq(outbox.id, id));
   }
 
-  async incrementAttempts(id: string, error: Error): Promise<void> {
-    await this.db
-      .update(outbox)
-      .set({
-        attempts: sql`${outbox.attempts} + 1`,
-        lastError: error.message.slice(0, 500),
-      })
-      .where(eq(outbox.id, id));
-  }
+  async incrementAttempts(id: string, error: Error): Promise<void> {}
 
   async getStats(): Promise<OutboxStats> {

[NoCoverage] ObjectLiteral
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:80:12
   async incrementAttempts(id: string, error: Error): Promise<void> {
     await this.db
       .update(outbox)
-      .set({
-        attempts: sql`${outbox.attempts} + 1`,
-        lastError: error.message.slice(0, 500),
-      })
+      .set({})
       .where(eq(outbox.id, id));
   }

[NoCoverage] MethodExpression
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:82:20
       .update(outbox)
       .set({
         attempts: sql`${outbox.attempts} + 1`,
-        lastError: error.message.slice(0, 500),
+        lastError: error.message,
       })
       .where(eq(outbox.id, id));

[NoCoverage] ArithmeticOperator
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:88:33
   }
 
   async getStats(): Promise<OutboxStats> {
-    const oneHourAgo = new Date(Date.now() - 60 * 60 * 1000);
+    const oneHourAgo = new Date(Date.now() + 60 * 60 * 1000);
 
     const [pendingRow] = await this.db

[NoCoverage] ArithmeticOperator
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:88:46
   }
 
   async getStats(): Promise<OutboxStats> {
-    const oneHourAgo = new Date(Date.now() - 60 * 60 * 1000);
+    const oneHourAgo = new Date(Date.now() - 60 * 60 / 1000);
 
     const [pendingRow] = await this.db

[NoCoverage] StringLiteral
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:96:35
       .where(eq(outbox.status, 'PENDING'));
 
     const [publishedRow] = await this.db
-      .select({ count: sql<number>`count(*)::int` })
+      .select({ count: sql<number>`` })
       .from(outbox)
       .where(and(eq(outbox.status, 'PUBLISHED'), gte(outbox.publishedAt, oneHourAgo)));

[NoCoverage] OptionalChaining
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:110:21
       .where(eq(outbox.status, 'PENDING'));
 
     return {
-      pendingCount: pendingRow?.count ?? 0,
+      pendingCount: pendingRow.count ?? 0,
       publishedCountLastHour: publishedRow?.count ?? 0,
       maxAttempts: attemptsRow?.max ?? 0,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:110:21
       .where(eq(outbox.status, 'PENDING'));
 
     return {
-      pendingCount: pendingRow?.count ?? 0,
+      pendingCount: pendingRow?.count && 0,
       publishedCountLastHour: publishedRow?.count ?? 0,
       maxAttempts: attemptsRow?.max ?? 0,

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:111:31
 
     return {
       pendingCount: pendingRow?.count ?? 0,
-      publishedCountLastHour: publishedRow?.count ?? 0,
+      publishedCountLastHour: publishedRow?.count && 0,
       maxAttempts: attemptsRow?.max ?? 0,
       oldestPendingAgeSeconds: oldestRow?.age ?? 0,

[NoCoverage] OptionalChaining
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:111:31
 
     return {
       pendingCount: pendingRow?.count ?? 0,
-      publishedCountLastHour: publishedRow?.count ?? 0,
+      publishedCountLastHour: publishedRow.count ?? 0,
       maxAttempts: attemptsRow?.max ?? 0,
       oldestPendingAgeSeconds: oldestRow?.age ?? 0,

[NoCoverage] OptionalChaining
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:112:20
     return {
       pendingCount: pendingRow?.count ?? 0,
       publishedCountLastHour: publishedRow?.count ?? 0,
-      maxAttempts: attemptsRow?.max ?? 0,
+      maxAttempts: attemptsRow.max ?? 0,
       oldestPendingAgeSeconds: oldestRow?.age ?? 0,
     };

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:112:20
     return {
       pendingCount: pendingRow?.count ?? 0,
       publishedCountLastHour: publishedRow?.count ?? 0,
-      maxAttempts: attemptsRow?.max ?? 0,
+      maxAttempts: attemptsRow?.max && 0,
       oldestPendingAgeSeconds: oldestRow?.age ?? 0,
     };

[NoCoverage] LogicalOperator
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:113:32
       pendingCount: pendingRow?.count ?? 0,
       publishedCountLastHour: publishedRow?.count ?? 0,
       maxAttempts: attemptsRow?.max ?? 0,
-      oldestPendingAgeSeconds: oldestRow?.age ?? 0,
+      oldestPendingAgeSeconds: oldestRow?.age && 0,
     };
   }

[NoCoverage] OptionalChaining
infrastructure/persistence/drizzle/drizzle-outbox.repository.ts:113:32
       pendingCount: pendingRow?.count ?? 0,
       publishedCountLastHour: publishedRow?.count ?? 0,
       maxAttempts: attemptsRow?.max ?? 0,
-      oldestPendingAgeSeconds: oldestRow?.age ?? 0,
+      oldestPendingAgeSeconds: oldestRow.age ?? 0,
     };
   }
