[Killed] BlockStatement
src/authorization/authorization.controller.ts:17:55
   ) {}
 
   @Get('store/:storeId/pending')
-  async getPending(@Param('storeId') storeId: string) {
-    const requests = await this.repository.findPendingByStore(storeId);
-    // El wire format debe coincidir con AuthorizationRequestDto (snake_case)
-    // compartido entre todos los servicios y la app móvil.
-    return requests.map((r) => ({
-      id: r.id,
-      store_id: r.storeId,
-      pos_id: r.posId,
-      correlation_id: r.correlationId,
-      type: r.type,
-      amount: r.amount,
-      employee_id: r.employeeId,
-      status: r.status,
-      created_at: r.createdAt.toISOString(),
-    }));
-  }
+  async getPending(@Param('storeId') storeId: string) {}
 
   @Get('store/:storeId/history')
killedBy: AuthorizationController GET /authorization/store/:storeId/pending — contrato del DTO (snake_case) devuelve los campos del request con nombres snake_case según AuthorizationRequestDto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/authorization/authorization.controller.ts:21:25
     const requests = await this.repository.findPendingByStore(storeId);
     // El wire format debe coincidir con AuthorizationRequestDto (snake_case)
     // compartido entre todos los servicios y la app móvil.
-    return requests.map((r) => ({
-      id: r.id,
-      store_id: r.storeId,
-      pos_id: r.posId,
-      correlation_id: r.correlationId,
-      type: r.type,
-      amount: r.amount,
-      employee_id: r.employeeId,
-      status: r.status,
-      created_at: r.createdAt.toISOString(),
-    }));
+    return requests.map(() => undefined);
   }
 
killedBy: AuthorizationController GET /authorization/store/:storeId/pending — contrato del DTO (snake_case) devuelve los campos del request con nombres snake_case según AuthorizationRequestDto
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] BlockStatement
src/authorization/authorization.controller.ts:37:17
   @Get('store/:storeId/history')
   async getHistory(@Param('storeId') storeId: string, @Query('status') status?: string, @Query('supervisorId') supervisorId?: string) {
     let resolvedStatus: AuthorizationStatus | undefined;
-    if (status) {
-      const upper = status.toUpperCase();
-      if (upper !== AuthorizationStatus.APPROVED && upper !== AuthorizationStatus.REJECTED) {
-        throw new BadRequestException(`Invalid status: ${status}. Valid values: APPROVED, REJECTED`);
-      }
-      resolvedStatus = upper as AuthorizationStatus;
-    }
+    if (status) {}
     const requests = await this.repository.findResolvedByStore(storeId, resolvedStatus, supervisorId);
     return requests.map((r) => ({
killedBy: AuthorizationController GET /authorization/store/:storeId/history — historial de autorizaciones combina filtros supervisorId + status (AND logic)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "store-001", "APPROVED", "supervisor-A"
Received: "store-001", undefined, "supervisor-A"

Number of calls: 1

[Killed] MethodExpression
src/authorization/authorization.controller.ts:38:21
   async getHistory(@Param('storeId') storeId: string, @Query('status') status?: string, @Query('supervisorId') supervisorId?: string) {
     let resolvedStatus: AuthorizationStatus | undefined;
     if (status) {
-      const upper = status.toUpperCase();
+      const upper = status.toLowerCase();
       if (upper !== AuthorizationStatus.APPROVED && upper !== AuthorizationStatus.REJECTED) {
         throw new BadRequestException(`Invalid status: ${status}. Valid values: APPROVED, REJECTED`);
killedBy: AuthorizationController GET /authorization/store/:storeId/history — historial de autorizaciones combina filtros supervisorId + status (AND logic)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/authorization/authorization.controller.ts:39:93
     let resolvedStatus: AuthorizationStatus | undefined;
     if (status) {
       const upper = status.toUpperCase();
-      if (upper !== AuthorizationStatus.APPROVED && upper !== AuthorizationStatus.REJECTED) {
-        throw new BadRequestException(`Invalid status: ${status}. Valid values: APPROVED, REJECTED`);
-      }
+      if (upper !== AuthorizationStatus.APPROVED && upper !== AuthorizationStatus.REJECTED) {}
       resolvedStatus = upper as AuthorizationStatus;
     }
killedBy: AuthorizationController GET /authorization/store/:storeId/history — historial de autorizaciones retorna 400 Bad Request cuando status es inválido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
src/authorization/authorization.controller.ts:39:11
     let resolvedStatus: AuthorizationStatus | undefined;
     if (status) {
       const upper = status.toUpperCase();
-      if (upper !== AuthorizationStatus.APPROVED && upper !== AuthorizationStatus.REJECTED) {
+      if (true) {
         throw new BadRequestException(`Invalid status: ${status}. Valid values: APPROVED, REJECTED`);
       }
killedBy: AuthorizationController GET /authorization/store/:storeId/history — historial de autorizaciones combina filtros supervisorId + status (AND logic)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ArrowFunction
src/authorization/authorization.controller.ts:45:25
       resolvedStatus = upper as AuthorizationStatus;
     }
     const requests = await this.repository.findResolvedByStore(storeId, resolvedStatus, supervisorId);
-    return requests.map((r) => ({
-      id: r.id,
-      store_id: r.storeId,
-      pos_id: r.posId,
-      correlation_id: r.correlationId,
-      type: r.type,
-      amount: r.amount,
-      employee_id: r.employeeId,
-      product_id: r.productId,
-      original_price: r.originalPrice,
-      requested_price: r.requestedPrice,
-      status: r.status,
-      resolved_by: r.resolvedBy,
-      resolved_at: r.resolvedAt?.toISOString(),
-      created_at: r.createdAt.toISOString(),
-    }));
+    return requests.map(() => undefined);
   }
 
killedBy: AuthorizationController GET /authorization/store/:storeId/history — historial de autorizaciones devuelve solicitudes resueltas para una tienda (sin filtros)
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] BlockStatement
src/authorization/authorization.controller.ts:67:5
   async resolve(
     @Param('id') id: string,
     @Body() dto: ResolveAuthorizationDto,
-  ) {
-    try {
-      const request = await this.resolveUseCase.execute(id, dto.decision, dto.supervisor_id);
-      // Wire format snake_case consistente con el resto del API y con
-      // el DTO compartido `AuthorizationResponseDto`. Ver bugfix
-      // `e2e-outbox-fixes` (2026-06-04) — Bug 6.
-      return {
-        id: request.id,
-        store_id: request.storeId,
-        pos_id: request.posId,
-        correlation_id: request.correlationId,
-        status: request.status,
-        resolved_by: request.resolvedBy,
-        resolved_at: request.resolvedAt?.toISOString(),
-        type: request.type,
-      };
-    } catch (error) {
-      if (error instanceof Error && error.message.includes('is already')) {
-        throw new ConflictException(error.message);
-      }
-      throw error;
-    }
-  }
+  ) {}
 }
 
killedBy: AuthorizationController POST /authorization/:id/resolve — mapeo de errores de dominio devuelve HTTP 409 cuando assertPending lanza Error("already APPROVED")
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 201

[Killed] BlockStatement
src/authorization/authorization.controller.ts:68:9
     @Param('id') id: string,
     @Body() dto: ResolveAuthorizationDto,
   ) {
-    try {
-      const request = await this.resolveUseCase.execute(id, dto.decision, dto.supervisor_id);
-      // Wire format snake_case consistente con el resto del API y con
-      // el DTO compartido `AuthorizationResponseDto`. Ver bugfix
-      // `e2e-outbox-fixes` (2026-06-04) — Bug 6.
-      return {
-        id: request.id,
-        store_id: request.storeId,
-        pos_id: request.posId,
-        correlation_id: request.correlationId,
-        status: request.status,
-        resolved_by: request.resolvedBy,
-        resolved_at: request.resolvedAt?.toISOString(),
-        type: request.type,
-      };
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof Error && error.message.includes('is already')) {
         throw new ConflictException(error.message);
killedBy: AuthorizationController POST /authorization/:id/resolve — mapeo de errores de dominio devuelve HTTP 409 cuando assertPending lanza Error("already APPROVED")
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 201

[Killed] BlockStatement
src/authorization/authorization.controller.ts:83:21
         resolved_at: request.resolvedAt?.toISOString(),
         type: request.type,
       };
-    } catch (error) {
-      if (error instanceof Error && error.message.includes('is already')) {
-        throw new ConflictException(error.message);
-      }
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: AuthorizationController POST /authorization/:id/resolve — mapeo de errores de dominio devuelve HTTP 409 cuando assertPending lanza Error("already APPROVED")
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 201

[Killed] BlockStatement
src/authorization/authorization.controller.ts:84:75
         type: request.type,
       };
     } catch (error) {
-      if (error instanceof Error && error.message.includes('is already')) {
-        throw new ConflictException(error.message);
-      }
+      if (error instanceof Error && error.message.includes('is already')) {}
       throw error;
     }
killedBy: AuthorizationController POST /authorization/:id/resolve — mapeo de errores de dominio devuelve HTTP 409 cuando assertPending lanza Error("already APPROVED")
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 500
