[Survived] ArrowFunction
src/infrastructure/events/redis-publisher.adapter.ts:42:31
       setCorrelationId: () => {},
     } as ILogger;
 
-    this.client.on('connect', () => this.logger.info('Redis publisher connected'));
+    this.client.on('connect', () => undefined);
     this.client.on('error', (err) => this.logger.error('Redis publisher error', err));
   }

[Survived] ArrowFunction
src/infrastructure/events/redis-publisher.adapter.ts:43:29
     } as ILogger;
 
     this.client.on('connect', () => this.logger.info('Redis publisher connected'));
-    this.client.on('error', (err) => this.logger.error('Redis publisher error', err));
+    this.client.on('error', () => undefined);
   }
 

[NoCoverage] StringLiteral
src/infrastructure/events/redis-publisher.adapter.ts:43:56
     } as ILogger;
 
     this.client.on('connect', () => this.logger.info('Redis publisher connected'));
-    this.client.on('error', (err) => this.logger.error('Redis publisher error', err));
+    this.client.on('error', (err) => this.logger.error("", err));
   }
 

[Killed] BlockStatement
src/infrastructure/events/redis-publisher.adapter.ts:46:64
     this.client.on('error', (err) => this.logger.error('Redis publisher error', err));
   }
 
-  async emit(channel: string, payload: unknown): Promise<void> {
-    // Build _trace envelope from active OTel span context, or generate new
-    const activeSpan = trace.getActiveSpan();
-    let spanContext = activeSpan?.spanContext();
-    if (!spanContext || !spanContext.traceId) {
-      const traceId = randomBytes(16).toString('hex');
-      const spanId = randomBytes(8).toString('hex');
-      spanContext = { traceId, spanId, traceFlags: 1 };
-    }
-    const ctx = trace.setSpanContext(ROOT_CONTEXT, spanContext);
-    const carrier: Record<string, string> = {};
-    w3cPropagator.inject(ctx, carrier, getTextMapSetter());
-
-    const traceEnvelope: Record<string, string> = {};
-    if (carrier.traceparent) traceEnvelope.traceparent = carrier.traceparent;
-    if (carrier.tracestate) traceEnvelope.tracestate = carrier.tracestate;
-
-    // Merge payload with _trace envelope
-    const enriched = {
-      ...(payload as Record<string, unknown>),
-      _trace: traceEnvelope,
-    };
-
-    await this.client.publish(channel, JSON.stringify(enriched));
-  }
+  async emit(channel: string, payload: unknown): Promise<void> {}
 
   async onModuleDestroy(): Promise<void> {
killedBy: RedisPublisherAdapter — correlation_id injection (US-03 — Test 10) emit() includes correlation_id in the published payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/events/redis-publisher.adapter.ts:60:9
     w3cPropagator.inject(ctx, carrier, getTextMapSetter());
 
     const traceEnvelope: Record<string, string> = {};
-    if (carrier.traceparent) traceEnvelope.traceparent = carrier.traceparent;
+    if (false) traceEnvelope.traceparent = carrier.traceparent;
     if (carrier.tracestate) traceEnvelope.tracestate = carrier.tracestate;
 
killedBy: RedisPublisherAdapter — trace context (US-02 — Test 7) _trace object contains traceparent
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "traceparent"
Received path: []

Received value: {}

[Survived] ConditionalExpression
src/infrastructure/events/redis-publisher.adapter.ts:60:9
     w3cPropagator.inject(ctx, carrier, getTextMapSetter());
 
     const traceEnvelope: Record<string, string> = {};
-    if (carrier.traceparent) traceEnvelope.traceparent = carrier.traceparent;
+    if (true) traceEnvelope.traceparent = carrier.traceparent;
     if (carrier.tracestate) traceEnvelope.tracestate = carrier.tracestate;
 

[Survived] ConditionalExpression
src/infrastructure/events/redis-publisher.adapter.ts:61:9
 
     const traceEnvelope: Record<string, string> = {};
     if (carrier.traceparent) traceEnvelope.traceparent = carrier.traceparent;
-    if (carrier.tracestate) traceEnvelope.tracestate = carrier.tracestate;
+    if (false) traceEnvelope.tracestate = carrier.tracestate;
 
     // Merge payload with _trace envelope

[Survived] ConditionalExpression
src/infrastructure/events/redis-publisher.adapter.ts:61:9
 
     const traceEnvelope: Record<string, string> = {};
     if (carrier.traceparent) traceEnvelope.traceparent = carrier.traceparent;
-    if (carrier.tracestate) traceEnvelope.tracestate = carrier.tracestate;
+    if (true) traceEnvelope.tracestate = carrier.tracestate;
 
     // Merge payload with _trace envelope

[NoCoverage] BlockStatement
src/infrastructure/events/redis-publisher.adapter.ts:72:42
     await this.client.publish(channel, JSON.stringify(enriched));
   }
 
-  async onModuleDestroy(): Promise<void> {
-    await this.client.quit();
-  }
+  async onModuleDestroy(): Promise<void> {}
 }
 
