[NoCoverage] BlockStatement
infrastructure/messaging/kafka/kafka-authorization-response-publisher.adapter.ts:13:86
     private readonly publisher: IMessagePublisher,
   ) {}
 
-  async reject(dto: AuthorizationRequestDto, reason: RejectionReason): Promise<void> {
-    await this.publisher.publish(`auth.response.${dto.store_id}`, {
-      store_id: dto.store_id,
-      pos_id: dto.pos_id,
-      correlation_id: dto.correlation_id,
-      status: AuthorizationStatus.REJECTED,
-      resolved_by: 'SYSTEM',
-      resolved_at: new Date().toISOString(),
-      rejection_reason: reason,
-    });
-  }
+  async reject(dto: AuthorizationRequestDto, reason: RejectionReason): Promise<void> {}
 }
 
