[Killed] EqualityOperator
src/domain/services/price-change-classifier.ts:12:9
 export class PriceChangeClassifier {
   static classify(originalPrice: number, requestedPrice: number): PriceChangeClassification {
     // 1. Igualdad de precios — sale antes de validar el mínimo
-    if (requestedPrice === originalPrice) {
+    if (requestedPrice !== originalPrice) {
       return 'EQUAL';
     }
killedBy: ProcessPriceChangeUseCase Escenario EQUAL — precios iguales: auto-aprobación silenciosa publica APPROVED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "APPROVED", "type": "PRICE_CHANGE"}

Number of calls: 0

[Killed] ConditionalExpression
src/domain/services/price-change-classifier.ts:12:9
 export class PriceChangeClassifier {
   static classify(originalPrice: number, requestedPrice: number): PriceChangeClassification {
     // 1. Igualdad de precios — sale antes de validar el mínimo
-    if (requestedPrice === originalPrice) {
+    if (false) {
       return 'EQUAL';
     }
killedBy: ProcessPriceChangeUseCase Escenario EQUAL — precios iguales: auto-aprobación silenciosa publica APPROVED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "APPROVED", "type": "PRICE_CHANGE"}

Number of calls: 0

[Killed] ConditionalExpression
src/domain/services/price-change-classifier.ts:17:9
     }
 
     // 2. Guardia de división por cero
-    if (originalPrice === 0) {
+    if (true) {
       throw new InvalidPriceError();
     }
killedBy: ProcessPriceChangeUseCase Escenario WITHIN_LIMIT — diferencia ≤ 50 %: flujo normal de autorización llama a repository.save con una solicitud en estado PENDING
statusReason: InvalidPriceError: original_price cannot be 0 (division by zero)

[Killed] EqualityOperator
src/domain/services/price-change-classifier.ts:17:9
     }
 
     // 2. Guardia de división por cero
-    if (originalPrice === 0) {
+    if (originalPrice !== 0) {
       throw new InvalidPriceError();
     }
killedBy: ProcessPriceChangeUseCase Escenario WITHIN_LIMIT — diferencia ≤ 50 %: flujo normal de autorización llama a repository.save con una solicitud en estado PENDING
statusReason: InvalidPriceError: original_price cannot be 0 (division by zero)

[Killed] BlockStatement
src/domain/services/price-change-classifier.ts:22:37
     }
 
     // 3. Precio mínimo
-    if (requestedPrice < MIN_PRICE) {
-      throw new MinimumPriceViolationError(requestedPrice);
-    }
+    if (requestedPrice < MIN_PRICE) {}
 
     // 4. Regla del 50 %
killedBy: PriceChangeClassifier Guardia de precio mínimo (MIN_PRICE = 150) lanza MinimumPriceViolationError cuando requested_price = 149
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MinimumPriceViolationError

Received function did not throw

[Killed] EqualityOperator
src/domain/services/price-change-classifier.ts:22:9
     }
 
     // 3. Precio mínimo
-    if (requestedPrice < MIN_PRICE) {
+    if (requestedPrice <= MIN_PRICE) {
       throw new MinimumPriceViolationError(requestedPrice);
     }
killedBy: PriceChangeClassifier Guardia de precio mínimo (MIN_PRICE = 150) NO lanza cuando requested_price = 150 (exactamente en el límite)
statusReason: Error: expect(received).not.toThrow()

Error name:    "MinimumPriceViolationError"
Error message: "Requested price 150 is below the minimum allowed price of 150"

      82 |         } else {
      83 |           stryCov_9fa48("101");
    > 84 |           throw new MinimumPriceViolationError(requestedPrice);

[Killed] ArithmeticOperator
src/domain/services/price-change-classifier.ts:27:19
     }
 
     // 4. Regla del 50 %
-    const ratio = Math.abs(originalPrice - requestedPrice) / originalPrice;
+    const ratio = Math.abs(originalPrice - requestedPrice) * originalPrice;
     if (ratio > 0.50) {
       return 'EXCEEDS_LIMIT';
killedBy: PriceChangeClassifier Regla del 50 % retorna WITHIN_LIMIT cuando la diferencia es ≤ 50 % (1000→600, diferencia 40 %)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WITHIN_LIMIT"
Received: "EXCEEDS_LIMIT"

[Killed] ArithmeticOperator
src/domain/services/price-change-classifier.ts:27:28
     }
 
     // 4. Regla del 50 %
-    const ratio = Math.abs(originalPrice - requestedPrice) / originalPrice;
+    const ratio = Math.abs(originalPrice + requestedPrice) / originalPrice;
     if (ratio > 0.50) {
       return 'EXCEEDS_LIMIT';
killedBy: ProcessPriceChangeUseCase Escenario WITHIN_LIMIT — diferencia ≤ 50 %: flujo normal de autorización llama a repository.save con una solicitud en estado PENDING
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/domain/services/price-change-classifier.ts:28:9
 
     // 4. Regla del 50 %
     const ratio = Math.abs(originalPrice - requestedPrice) / originalPrice;
-    if (ratio > 0.50) {
+    if (false) {
       return 'EXCEEDS_LIMIT';
     }
killedBy: ProcessPriceChangeUseCase Escenario EXCEEDS_LIMIT — diferencia > 50 %: rechazo inmediato + presencia física publica REJECTED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "REJECTED", "type": "PRICE_CHANGE"}

Number of calls: 0

[Killed] BlockStatement
src/domain/services/price-change-classifier.ts:28:23
 
     // 4. Regla del 50 %
     const ratio = Math.abs(originalPrice - requestedPrice) / originalPrice;
-    if (ratio > 0.50) {
-      return 'EXCEEDS_LIMIT';
-    }
+    if (ratio > 0.50) {}
 
     return 'WITHIN_LIMIT';
killedBy: ProcessPriceChangeUseCase Escenario EXCEEDS_LIMIT — diferencia > 50 %: rechazo inmediato + presencia física publica REJECTED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "REJECTED", "type": "PRICE_CHANGE"}

Number of calls: 0
