[Killed] BlockStatement
src/infrastructure/active-directory/http-active-directory.adapter.ts:45:40
         accountEnabled: dto.accountEnabled,
       };
     } catch (error) {
-      if (error instanceof AxiosError) {
-        const status = error.response?.status;
-
-        if (status === 404) {
-          throw new EmployeeNotFoundException(employeeId);
-        }
-
-        // 401, 403, 5xx, timeout (no response), or any other Axios error
-        throw new AdLookupException(
-          error.message ?? `HTTP ${status ?? 'unknown'}`,
-        );
-      }
+      if (error instanceof AxiosError) {}
 
       throw error;
killedBy: HttpActiveDirectoryAdapter lookupByEmployeeId — HTTP 404 lanza EmployeeNotFoundException (no AdLookupException)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmployeeNotFoundException
Received constructor: AxiosError

Received message: "error"

      23 |

[Killed] ConditionalExpression
src/infrastructure/active-directory/http-active-directory.adapter.ts:48:13
       if (error instanceof AxiosError) {
         const status = error.response?.status;
 
-        if (status === 404) {
+        if (false) {
           throw new EmployeeNotFoundException(employeeId);
         }
killedBy: HttpActiveDirectoryAdapter lookupByEmployeeId — HTTP 404 lanza EmployeeNotFoundException (no AdLookupException)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmployeeNotFoundException
Received constructor: AdLookupException

Received message: "Active Directory lookup failed: error"

      104 |

[Killed] EqualityOperator
src/infrastructure/active-directory/http-active-directory.adapter.ts:48:13
       if (error instanceof AxiosError) {
         const status = error.response?.status;
 
-        if (status === 404) {
+        if (status !== 404) {
           throw new EmployeeNotFoundException(employeeId);
         }
killedBy: HttpActiveDirectoryAdapter lookupByEmployeeId — HTTP 404 lanza EmployeeNotFoundException (no AdLookupException)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmployeeNotFoundException
Received constructor: AdLookupException

Received message: "Active Directory lookup failed: error"

      104 |

[NoCoverage] LogicalOperator
src/infrastructure/active-directory/http-active-directory.adapter.ts:54:36
 
         // 401, 403, 5xx, timeout (no response), or any other Axios error
         throw new AdLookupException(
-          error.message ?? `HTTP ${status ?? 'unknown'}`,
+          error.message ?? `HTTP ${status && 'unknown'}`,
         );
       }

[Survived] LogicalOperator
src/infrastructure/active-directory/http-active-directory.adapter.ts:54:11
 
         // 401, 403, 5xx, timeout (no response), or any other Axios error
         throw new AdLookupException(
-          error.message ?? `HTTP ${status ?? 'unknown'}`,
+          error.message && `HTTP ${status ?? 'unknown'}`,
         );
       }
