[Survived] BooleanLiteral
src/infrastructure/logging/otel-sdk.ts:16:19
 }
 
 let sdkInstance: NodeSDK | null = null;
-let initialized = false;
+let initialized = true;
 
 export function initOtel(config?: OtelConfig): () => void {

[Survived] ConditionalExpression
src/infrastructure/logging/otel-sdk.ts:19:7
 let initialized = false;
 
 export function initOtel(config?: OtelConfig): () => void {
-  if (initialized && sdkInstance) {
+  if (false) {
     return () => shutdownOtel();
   }

[Survived] LogicalOperator
src/infrastructure/logging/otel-sdk.ts:19:7
 let initialized = false;
 
 export function initOtel(config?: OtelConfig): () => void {
-  if (initialized && sdkInstance) {
+  if (initialized || sdkInstance) {
     return () => shutdownOtel();
   }

[Survived] ArrowFunction
src/infrastructure/logging/otel-sdk.ts:20:12
 
 export function initOtel(config?: OtelConfig): () => void {
   if (initialized && sdkInstance) {
-    return () => shutdownOtel();
+    return () => undefined;
   }
 

[Survived] LogicalOperator
src/infrastructure/logging/otel-sdk.ts:24:5
   }
 
   const serviceName =
-    config?.serviceName ?? process.env.OTEL_SERVICE_NAME ?? 'authorization-service';
+    (config?.serviceName ?? process.env.OTEL_SERVICE_NAME) && 'authorization-service';
   const exporterEndpoint =
     config?.exporterEndpoint ?? process.env.OTEL_EXPORTER_OTLP_ENDPOINT;

[Survived] StringLiteral
src/infrastructure/logging/otel-sdk.ts:24:61
   }
 
   const serviceName =
-    config?.serviceName ?? process.env.OTEL_SERVICE_NAME ?? 'authorization-service';
+    config?.serviceName ?? process.env.OTEL_SERVICE_NAME ?? "";
   const exporterEndpoint =
     config?.exporterEndpoint ?? process.env.OTEL_EXPORTER_OTLP_ENDPOINT;

[Survived] LogicalOperator
src/infrastructure/logging/otel-sdk.ts:26:5
   const serviceName =
     config?.serviceName ?? process.env.OTEL_SERVICE_NAME ?? 'authorization-service';
   const exporterEndpoint =
-    config?.exporterEndpoint ?? process.env.OTEL_EXPORTER_OTLP_ENDPOINT;
+    config?.exporterEndpoint && process.env.OTEL_EXPORTER_OTLP_ENDPOINT;
 
   // Always set W3C TraceContext propagator

[Survived] StringLiteral
src/infrastructure/logging/otel-sdk.ts:34:50
   // Use OTLP exporter if endpoint available, otherwise console exporter
   const traceExporter = exporterEndpoint
     ? new OTLPTraceExporter({
-        url: `${exporterEndpoint.replace(/\/+$/, '')}/v1/traces`,
+        url: `${exporterEndpoint.replace(/\/+$/, "Stryker was here!")}/v1/traces`,
       })
     : new node.ConsoleSpanExporter();

[Survived] Regex
src/infrastructure/logging/otel-sdk.ts:34:42
   // Use OTLP exporter if endpoint available, otherwise console exporter
   const traceExporter = exporterEndpoint
     ? new OTLPTraceExporter({
-        url: `${exporterEndpoint.replace(/\/+$/, '')}/v1/traces`,
+        url: `${exporterEndpoint.replace(/\/+/, '')}/v1/traces`,
       })
     : new node.ConsoleSpanExporter();

[Survived] ObjectLiteral
src/infrastructure/logging/otel-sdk.ts:38:29
       })
     : new node.ConsoleSpanExporter();
 
-  sdkInstance = new NodeSDK({
-    serviceName,
-    traceExporter,
-    instrumentations: [
-      new HttpInstrumentation(),
-      new ExpressInstrumentation(),
-      new NestInstrumentation(),
-      new IORedisInstrumentation(),
-      new KafkaJsInstrumentation(),
-    ],
-  });
+  sdkInstance = new NodeSDK({});
 
   sdkInstance.start();

[Survived] BooleanLiteral
src/infrastructure/logging/otel-sdk.ts:51:17
   });
 
   sdkInstance.start();
-  initialized = true;
+  initialized = false;
 
   return () => shutdownOtel();

[Survived] ArrowFunction
src/infrastructure/logging/otel-sdk.ts:53:10
   sdkInstance.start();
   initialized = true;
 
-  return () => shutdownOtel();
+  return () => undefined;
 }
 

[Survived] BlockStatement
src/infrastructure/logging/otel-sdk.ts:56:31
   return () => shutdownOtel();
 }
 
-function shutdownOtel(): void {
-  if (sdkInstance) {
-    sdkInstance.shutdown().catch((err: unknown) => {
-      console.warn('Error shutting down OTel SDK:', err);
-    });
-    sdkInstance = null;
-    initialized = false;
-  }
-}
+function shutdownOtel(): void {}
 
 // Auto-initialize when imported as side-effect module

[Survived] BlockStatement
src/infrastructure/logging/otel-sdk.ts:57:20
 }
 
 function shutdownOtel(): void {
-  if (sdkInstance) {
-    sdkInstance.shutdown().catch((err: unknown) => {
-      console.warn('Error shutting down OTel SDK:', err);
-    });
-    sdkInstance = null;
-    initialized = false;
-  }
+  if (sdkInstance) {}
 }
 

[NoCoverage] BlockStatement
src/infrastructure/logging/otel-sdk.ts:58:52
 
 function shutdownOtel(): void {
   if (sdkInstance) {
-    sdkInstance.shutdown().catch((err: unknown) => {
-      console.warn('Error shutting down OTel SDK:', err);
-    });
+    sdkInstance.shutdown().catch((err: unknown) => {});
     sdkInstance = null;
     initialized = false;

[NoCoverage] StringLiteral
src/infrastructure/logging/otel-sdk.ts:59:20
 function shutdownOtel(): void {
   if (sdkInstance) {
     sdkInstance.shutdown().catch((err: unknown) => {
-      console.warn('Error shutting down OTel SDK:', err);
+      console.warn("", err);
     });
     sdkInstance = null;

[Survived] BooleanLiteral
src/infrastructure/logging/otel-sdk.ts:62:19
       console.warn('Error shutting down OTel SDK:', err);
     });
     sdkInstance = null;
-    initialized = false;
+    initialized = true;
   }
 }
