[Killed] ConditionalExpression
src/domain/use-cases/verify-employee-benefit.use-case.ts:35:27
         `AD lookup successful for employee ${dto.employee_id}: associate=${adUser.associate}, accountEnabled=${adUser.accountEnabled}`,
       );
 
-      const isAssociate = adUser.associate === true;
+      const isAssociate = true;
       const isAccountEnabled = adUser.accountEnabled === true;
 
killedBy: VerifyEmployeeBenefitUseCase Escenario 2 — associate: false: rechazo automático EMPLOYEE_NOT_ACTIVE publica rechazo con rejection_reason EMPLOYEE_NOT_ACTIVE via responsePublisher.reject
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"correlation_id": "corr-abc", "created_at": "2026-06-11T22:48:13.874Z", "employee_id": "12345678-9", "pos_id": "pos-01", "store_id": "store-001", "type": "EMPLOYEE_BENEFIT"}, "EMPLOYEE_NOT_ACTIVE"

Number of calls: 0

[Killed] BooleanLiteral
src/domain/use-cases/verify-employee-benefit.use-case.ts:35:48
         `AD lookup successful for employee ${dto.employee_id}: associate=${adUser.associate}, accountEnabled=${adUser.accountEnabled}`,
       );
 
-      const isAssociate = adUser.associate === true;
+      const isAssociate = adUser.associate === false;
       const isAccountEnabled = adUser.accountEnabled === true;
 
killedBy: VerifyEmployeeBenefitUseCase Escenario 1 — empleado activo y asociado: flujo normal hacia el supervisor consulta AD, guarda la solicitud, emite el evento con datos del empleado y NO publica rechazo en
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/domain/use-cases/verify-employee-benefit.use-case.ts:36:58
       );
 
       const isAssociate = adUser.associate === true;
-      const isAccountEnabled = adUser.accountEnabled === true;
+      const isAccountEnabled = adUser.accountEnabled === false;
 
       if (isAssociate && isAccountEnabled) {
killedBy: VerifyEmployeeBenefitUseCase Escenario 1 — empleado activo y asociado: flujo normal hacia el supervisor consulta AD, guarda la solicitud, emite el evento con datos del empleado y NO publica rechazo en
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
src/domain/use-cases/verify-employee-benefit.use-case.ts:36:32
       );
 
       const isAssociate = adUser.associate === true;
-      const isAccountEnabled = adUser.accountEnabled === true;
+      const isAccountEnabled = adUser.accountEnabled !== true;
 
       if (isAssociate && isAccountEnabled) {
killedBy: VerifyEmployeeBenefitUseCase Escenario 1 — empleado activo y asociado: flujo normal hacia el supervisor consulta AD, guarda la solicitud, emite el evento con datos del empleado y NO publica rechazo en
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/domain/use-cases/verify-employee-benefit.use-case.ts:38:44
       const isAssociate = adUser.associate === true;
       const isAccountEnabled = adUser.accountEnabled === true;
 
-      if (isAssociate && isAccountEnabled) {
-        const request = AuthorizationRequest.fromDto(dto);
-        await this.repository.save(request);
-
-        await this.eventEmitter.emit(`store:${dto.store_id}:requests`, {
-          correlation_id: dto.correlation_id,
-          type: dto.type,
-          store_id: dto.store_id,
-          pos_id: dto.pos_id,
-          employee_id: dto.employee_id,
-          displayName: adUser.displayName,
-          jobTitle: adUser.jobTitle,
-          department: adUser.department,
-        });
-        return;
-      }
+      if (isAssociate && isAccountEnabled) {}
 
       const reason = !isAccountEnabled
killedBy: VerifyEmployeeBenefitUseCase Escenario 1 — empleado activo y asociado: flujo normal hacia el supervisor consulta AD, guarda la solicitud, emite el evento con datos del empleado y NO publica rechazo en
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/domain/use-cases/verify-employee-benefit.use-case.ts:38:11
       const isAssociate = adUser.associate === true;
       const isAccountEnabled = adUser.accountEnabled === true;
 
-      if (isAssociate && isAccountEnabled) {
+      if (false) {
         const request = AuthorizationRequest.fromDto(dto);
         await this.repository.save(request);
killedBy: VerifyEmployeeBenefitUseCase Escenario 1 — empleado activo y asociado: flujo normal hacia el supervisor consulta AD, guarda la solicitud, emite el evento con datos del empleado y NO publica rechazo en
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ObjectLiteral
src/domain/use-cases/verify-employee-benefit.use-case.ts:42:72
         const request = AuthorizationRequest.fromDto(dto);
         await this.repository.save(request);
 
-        await this.eventEmitter.emit(`store:${dto.store_id}:requests`, {
-          correlation_id: dto.correlation_id,
-          type: dto.type,
-          store_id: dto.store_id,
-          pos_id: dto.pos_id,
-          employee_id: dto.employee_id,
-          displayName: adUser.displayName,
-          jobTitle: adUser.jobTitle,
-          department: adUser.department,
-        });
+        await this.eventEmitter.emit(`store:${dto.store_id}:requests`, {});
         return;
       }
killedBy: VerifyEmployeeBenefitUseCase Escenario 1 — empleado activo y asociado: flujo normal hacia el supervisor consulta AD, guarda la solicitud, emite el evento con datos del empleado y NO publica rechazo en
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "store:store-001:requests", ObjectContaining {"correlation_id": "corr-abc", "department": "Caja", "displayName": "Juan Pérez", "employee_id": "12345678-9", "jobTitle": "Cajero", "pos_id": "pos-01", "store_id": "store-001", "type": "EMPLOYEE_BENEFIT"}
Received: "store:store-001:requests", {}

Number of calls: 1

[Killed] BooleanLiteral
src/domain/use-cases/verify-employee-benefit.use-case.ts:55:22
         return;
       }
 
-      const reason = !isAccountEnabled
+      const reason = isAccountEnabled
         ? RejectionReason.ACCOUNT_DISABLED
         : RejectionReason.EMPLOYEE_NOT_ACTIVE;
killedBy: VerifyEmployeeBenefitUseCase Escenario 2 — associate: false: rechazo automático EMPLOYEE_NOT_ACTIVE publica rechazo con rejection_reason EMPLOYEE_NOT_ACTIVE via responsePublisher.reject
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"correlation_id": "corr-abc", "created_at": "2026-06-11T22:48:20.452Z", "employee_id": "12345678-9", "pos_id": "pos-01", "store_id": "store-001", "type": "EMPLOYEE_BENEFIT"},
- "EMPLOYEE_NOT_ACTIVE",
+ "ACCOUNT_DISABLED",

[Killed] BlockStatement
src/domain/use-cases/verify-employee-benefit.use-case.ts:60:21
         : RejectionReason.EMPLOYEE_NOT_ACTIVE;
 
       await this.responsePublisher.reject(dto, reason);
-    } catch (error) {
-      if (error instanceof EmployeeNotFoundException) {
-        this.logger.warn(
-          `Employee not found in AD: ${dto.employee_id}`,
-        );
-        await this.responsePublisher.reject(dto, RejectionReason.EMPLOYEE_NOT_FOUND);
-        return;
-      }
-
-      if (error instanceof AdLookupException) {
-        this.logger.error(
-          `AD lookup failed for employee ${dto.employee_id}: ${(error as Error).message}`,
-        );
-        await this.responsePublisher.reject(dto, RejectionReason.AD_LOOKUP_FAILED);
-        return;
-      }
-
-      // Re-throw unexpected errors
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: VerifyEmployeeBenefitUseCase Escenario 4 — AD responde 404: rechazo EMPLOYEE_NOT_FOUND cuando el port lanza EmployeeNotFoundException, llama a reject con RejectionReason.EMPLOYEE_NOT_FOUND
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"correlation_id": "corr-abc", "created_at": "2026-06-11T22:48:21.080Z", "employee_id": "12345678-9", "pos_id": "pos-01", "store_id": "store-001", "type": "EMPLOYEE_BENEFIT"}, "EMPLOYEE_NOT_FOUND"

Number of calls: 0

[Killed] ConditionalExpression
src/domain/use-cases/verify-employee-benefit.use-case.ts:61:11
 
       await this.responsePublisher.reject(dto, reason);
     } catch (error) {
-      if (error instanceof EmployeeNotFoundException) {
+      if (true) {
         this.logger.warn(
           `Employee not found in AD: ${dto.employee_id}`,
killedBy: VerifyEmployeeBenefitUseCase Escenario 5 — AD falla (5xx/timeout/401/403): rechazo AD_LOOKUP_FAILED cuando el port lanza AdLookupException, llama a reject con RejectionReason.AD_LOOKUP_FAILED
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"correlation_id": "corr-abc", "created_at": "2026-06-11T22:48:27.311Z", "employee_id": "12345678-9", "pos_id": "pos-01", "store_id": "store-001", "type": "EMPLOYEE_BENEFIT"},
- "AD_LOOKUP_FAILED",
+ "EMPLOYEE_NOT_FOUND",

[Killed] BlockStatement
src/domain/use-cases/verify-employee-benefit.use-case.ts:61:55
 
       await this.responsePublisher.reject(dto, reason);
     } catch (error) {
-      if (error instanceof EmployeeNotFoundException) {
-        this.logger.warn(
-          `Employee not found in AD: ${dto.employee_id}`,
-        );
-        await this.responsePublisher.reject(dto, RejectionReason.EMPLOYEE_NOT_FOUND);
-        return;
-      }
+      if (error instanceof EmployeeNotFoundException) {}
 
       if (error instanceof AdLookupException) {
killedBy: VerifyEmployeeBenefitUseCase Escenario 4 — AD responde 404: rechazo EMPLOYEE_NOT_FOUND cuando el port lanza EmployeeNotFoundException, llama a reject con RejectionReason.EMPLOYEE_NOT_FOUND
statusReason: EmployeeNotFoundException: Employee not found in Active Directory: 12345678-9

[Killed] ConditionalExpression
src/domain/use-cases/verify-employee-benefit.use-case.ts:69:11
         return;
       }
 
-      if (error instanceof AdLookupException) {
+      if (false) {
         this.logger.error(
           `AD lookup failed for employee ${dto.employee_id}: ${(error as Error).message}`,
killedBy: VerifyEmployeeBenefitUseCase Escenario 5 — AD falla (5xx/timeout/401/403): rechazo AD_LOOKUP_FAILED cuando el port lanza AdLookupException, llama a reject con RejectionReason.AD_LOOKUP_FAILED
statusReason: AdLookupException: Active Directory lookup failed: timeout

[Killed] BlockStatement
src/domain/use-cases/verify-employee-benefit.use-case.ts:69:47
         return;
       }
 
-      if (error instanceof AdLookupException) {
-        this.logger.error(
-          `AD lookup failed for employee ${dto.employee_id}: ${(error as Error).message}`,
-        );
-        await this.responsePublisher.reject(dto, RejectionReason.AD_LOOKUP_FAILED);
-        return;
-      }
+      if (error instanceof AdLookupException) {}
 
       // Re-throw unexpected errors
killedBy: VerifyEmployeeBenefitUseCase Escenario 5 — AD falla (5xx/timeout/401/403): rechazo AD_LOOKUP_FAILED cuando el port lanza AdLookupException, llama a reject con RejectionReason.AD_LOOKUP_FAILED
statusReason: AdLookupException: Active Directory lookup failed: timeout

[Survived] StringLiteral
src/domain/use-cases/verify-employee-benefit.use-case.ts:71:11
 
       if (error instanceof AdLookupException) {
         this.logger.error(
-          `AD lookup failed for employee ${dto.employee_id}: ${(error as Error).message}`,
+          ``,
         );
         await this.responsePublisher.reject(dto, RejectionReason.AD_LOOKUP_FAILED);
