[NoCoverage] BlockStatement
src/authorization/authorization.module.ts:123:39
     private readonly processUseCase: ProcessAuthorizationRequestUseCase,
   ) {}
 
-  async onModuleInit(): Promise<void> {
-    await this.consumer.subscribe(
-      ['auth.requests'],
-      'authorization-service-group',
-      async (_topic: string, message: unknown) => {
-        await this.processUseCase.execute(message as AuthorizationRequestDto);
-      },
-    );
-  }
+  async onModuleInit(): Promise<void> {}
 }
 

[NoCoverage] BlockStatement
src/authorization/authorization.module.ts:127:51
     await this.consumer.subscribe(
       ['auth.requests'],
       'authorization-service-group',
-      async (_topic: string, message: unknown) => {
-        await this.processUseCase.execute(message as AuthorizationRequestDto);
-      },
+      async (_topic: string, message: unknown) => {},
     );
   }
