[Killed] EqualityOperator
src/domain/entities/authorization-request.entity.ts:50:27
   }
 
   static fromDto(dto: AuthorizationRequestDto): AuthorizationRequest {
-    const isPriceChange = dto.type === RequestType.PRICE_CHANGE;
+    const isPriceChange = dto.type !== RequestType.PRICE_CHANGE;
     return new AuthorizationRequest({
       id: uuidv4(),
killedBy: ProcessPriceChangeUseCase Escenario WITHIN_LIMIT — diferencia ≤ 50 %: flujo normal de autorización la solicitud guardada contiene los campos de precio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000
Received: undefined

[Killed] ConditionalExpression
src/domain/entities/authorization-request.entity.ts:50:27
   }
 
   static fromDto(dto: AuthorizationRequestDto): AuthorizationRequest {
-    const isPriceChange = dto.type === RequestType.PRICE_CHANGE;
+    const isPriceChange = false;
     return new AuthorizationRequest({
       id: uuidv4(),
killedBy: ProcessPriceChangeUseCase Escenario WITHIN_LIMIT — diferencia ≤ 50 %: flujo normal de autorización la solicitud guardada contiene los campos de precio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000
Received: undefined

[NoCoverage] BlockStatement
src/domain/entities/authorization-request.entity.ts:101:25
       createdAt: row.createdAt,
       status: row.status as AuthorizationStatus,
     });
-    if (row.resolvedBy) {
-      entity._resolvedBy = row.resolvedBy;
-    }
+    if (row.resolvedBy) {}
     if (row.resolvedAt) {
       entity._resolvedAt = row.resolvedAt;

[NoCoverage] BlockStatement
src/domain/entities/authorization-request.entity.ts:104:25
     if (row.resolvedBy) {
       entity._resolvedBy = row.resolvedBy;
     }
-    if (row.resolvedAt) {
-      entity._resolvedAt = row.resolvedAt;
-    }
+    if (row.resolvedAt) {}
     return entity;
   }

[Killed] BlockStatement
src/domain/entities/authorization-request.entity.ts:122:39
     return this._resolvedAt;
   }
 
-  approve(supervisorId: string): void {
-    this.assertPending();
-    this._status = AuthorizationStatus.APPROVED;
-    this._resolvedBy = supervisorId;
-    this._resolvedAt = new Date();
-  }
+  approve(supervisorId: string): void {}
 
   reject(supervisorId: string): void {
killedBy: AuthorizationController POST /authorization/:id/resolve — mapeo de errores de dominio responde con snake_case (resolved_by, resolved_at) consistente con AuthorizationResponseDto
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "resolved_by"
Received path: []

Received value: {"correlation_id": "corr-xyz", "id": "5dcaffb2-be5a-4b3e-a1ff-44ffebd1d82e", "pos_id": "pos-01", "status": "PENDING", "store_id": "store-001", "type": "DISCOUNT"}

[Killed] BlockStatement
src/domain/entities/authorization-request.entity.ts:129:38
     this._resolvedAt = new Date();
   }
 
-  reject(supervisorId: string): void {
-    this.assertPending();
-    this._status = AuthorizationStatus.REJECTED;
-    this._resolvedBy = supervisorId;
-    this._resolvedAt = new Date();
-  }
+  reject(supervisorId: string): void {}
 
   isPending(): boolean {
killedBy: AuthorizationController GET /authorization/store/:storeId/history — historial de autorizaciones mantiene compatibilidad hacia atrás: sin supervisorId retorna todas las resueltas
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "supervisor-B"
Received array: ["supervisor-A", undefined]

[NoCoverage] ConditionalExpression
src/domain/entities/authorization-request.entity.ts:137:12
   }
 
   isPending(): boolean {
-    return this._status === AuthorizationStatus.PENDING;
+    return false;
   }
 

[NoCoverage] EqualityOperator
src/domain/entities/authorization-request.entity.ts:137:12
   }
 
   isPending(): boolean {
-    return this._status === AuthorizationStatus.PENDING;
+    return this._status !== AuthorizationStatus.PENDING;
   }
 

[Killed] BlockStatement
src/domain/entities/authorization-request.entity.ts:140:33
     return this._status === AuthorizationStatus.PENDING;
   }
 
-  private assertPending(): void {
-    if (this._status !== AuthorizationStatus.PENDING) {
-      throw new Error(`Authorization ${this.id} is already ${this._status}`);
-    }
-  }
+  private assertPending(): void {}
 }
 
killedBy: ResolveAuthorizationUseCase con outbox (US-01) Idempotencia — ya resuelto lanza error si la solicitud ya está APPROVED
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] ConditionalExpression
src/domain/entities/authorization-request.entity.ts:141:9
   }
 
   private assertPending(): void {
-    if (this._status !== AuthorizationStatus.PENDING) {
+    if (true) {
       throw new Error(`Authorization ${this.id} is already ${this._status}`);
     }
killedBy: AuthorizationController POST /authorization/:id/resolve — mapeo de errores de dominio devuelve HTTP 200 y el resultado cuando la resolución es exitosa
statusReason: Error: Authorization 531055bf-0a9c-481c-8f84-22c462acbc6c is already PENDING

[Killed] BlockStatement
src/domain/entities/authorization-request.entity.ts:141:55
   }
 
   private assertPending(): void {
-    if (this._status !== AuthorizationStatus.PENDING) {
-      throw new Error(`Authorization ${this.id} is already ${this._status}`);
-    }
+    if (this._status !== AuthorizationStatus.PENDING) {}
   }
 }
killedBy: ResolveAuthorizationUseCase con outbox (US-01) Idempotencia — ya resuelto lanza error si la solicitud ya está APPROVED
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
