[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle.provider.ts:26:15
    */
   useFactory: (): { db: DrizzleDb; pool: Pool } => {
     const url = process.env['DATABASE_URL'];
-    if (!url) {
-      throw new Error('DATABASE_URL is not set. Check .env');
-    }
+    if (!url) {}
     const pool = new Pool({ connectionString: url, max: 10 });
     const db = drizzle(pool, { schema });

[NoCoverage] ConditionalExpression
infrastructure/persistence/drizzle/drizzle.provider.ts:26:9
    */
   useFactory: (): { db: DrizzleDb; pool: Pool } => {
     const url = process.env['DATABASE_URL'];
-    if (!url) {
+    if (true) {
       throw new Error('DATABASE_URL is not set. Check .env');
     }

[NoCoverage] BlockStatement
infrastructure/persistence/drizzle/drizzle.provider.ts:45:42
 
   constructor(@Inject(DRIZZLE) private readonly provider: { db: DrizzleDb; pool: Pool }) {}
 
-  async onModuleDestroy(): Promise<void> {
-    await this.provider.pool.end();
-    this.logger.log('Postgres pool closed');
-  }
+  async onModuleDestroy(): Promise<void> {}
 }
 
