[NoCoverage] StringLiteral
infrastructure/persistence/drizzle/schema.ts:8:36
  * del dominio de autorización y permite grant/revoke de permisos a nivel
  * de schema en producción.
  */
-export const authSchema = pgSchema('auth');
+export const authSchema = pgSchema("");
 
 export const outboxStatusEnum = pgEnum('outbox_status', ['PENDING', 'PUBLISHED']);

[NoCoverage] StringLiteral
infrastructure/persistence/drizzle/schema.ts:21:17
  */
 export const authorizationRequests = authSchema.table('authorization_requests', {
   id: uuid('id').primaryKey().defaultRandom(),
-  storeId: text('store_id').notNull(),
+  storeId: text("").notNull(),
   posId: text('pos_id').notNull(),
   correlationId: text('correlation_id').notNull().unique(),

[NoCoverage] StringLiteral
infrastructure/persistence/drizzle/schema.ts:23:23
   id: uuid('id').primaryKey().defaultRandom(),
   storeId: text('store_id').notNull(),
   posId: text('pos_id').notNull(),
-  correlationId: text('correlation_id').notNull().unique(),
+  correlationId: text("").notNull().unique(),
   type: text('type').notNull(),
   status: text('status').notNull(),

[NoCoverage] StringLiteral
infrastructure/persistence/drizzle/schema.ts:29:26
   amount: integer('amount'),
   employeeId: text('employee_id'),
   productId: text('product_id'),
-  originalPrice: integer('original_price'),
+  originalPrice: integer(""),
   requestedPrice: integer('requested_price'),
   resolvedBy: text('resolved_by'),

[NoCoverage] BooleanLiteral
infrastructure/persistence/drizzle/schema.ts:32:56
   originalPrice: integer('original_price'),
   requestedPrice: integer('requested_price'),
   resolvedBy: text('resolved_by'),
-  resolvedAt: timestamp('resolved_at', { withTimezone: true }),
+  resolvedAt: timestamp('resolved_at', { withTimezone: false }),
   createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
 });

[NoCoverage] BooleanLiteral
infrastructure/persistence/drizzle/schema.ts:33:54
   requestedPrice: integer('requested_price'),
   resolvedBy: text('resolved_by'),
   resolvedAt: timestamp('resolved_at', { withTimezone: true }),
-  createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+  createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
 });
 

[NoCoverage] StringLiteral
infrastructure/persistence/drizzle/schema.ts:41:40
  * (`OutboxPublisherService`) toma rows PENDING, las publica, y las marca
  * PUBLISHED. `SELECT ... FOR UPDATE SKIP LOCKED` permite múltiples workers.
  */
-export const outbox = authSchema.table('outbox', {
+export const outbox = authSchema.table("", {
   id: uuid('id').primaryKey().defaultRandom(),
   correlationId: text('correlation_id').notNull(),

[NoCoverage] StringLiteral
infrastructure/persistence/drizzle/schema.ts:50:19
   status: outboxStatusEnum('status').notNull().default('PENDING'),
   attempts: integer('attempts').notNull().default(0),
   /** Mensaje del último error si attempts > 0. */
-  lastError: text('last_error'),
+  lastError: text(""),
   createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
   publishedAt: timestamp('published_at', { withTimezone: true }),

[NoCoverage] BooleanLiteral
infrastructure/persistence/drizzle/schema.ts:51:54
   attempts: integer('attempts').notNull().default(0),
   /** Mensaje del último error si attempts > 0. */
   lastError: text('last_error'),
-  createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+  createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
   publishedAt: timestamp('published_at', { withTimezone: true }),
 });

[NoCoverage] ObjectLiteral
infrastructure/persistence/drizzle/schema.ts:51:38
   attempts: integer('attempts').notNull().default(0),
   /** Mensaje del último error si attempts > 0. */
   lastError: text('last_error'),
-  createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+  createdAt: timestamp('created_at', {}).notNull().defaultNow(),
   publishedAt: timestamp('published_at', { withTimezone: true }),
 });

[NoCoverage] BooleanLiteral
infrastructure/persistence/drizzle/schema.ts:52:58
   /** Mensaje del último error si attempts > 0. */
   lastError: text('last_error'),
   createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
-  publishedAt: timestamp('published_at', { withTimezone: true }),
+  publishedAt: timestamp('published_at', { withTimezone: false }),
 });
 

[NoCoverage] ObjectLiteral
infrastructure/persistence/drizzle/schema.ts:52:42
   /** Mensaje del último error si attempts > 0. */
   lastError: text('last_error'),
   createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
-  publishedAt: timestamp('published_at', { withTimezone: true }),
+  publishedAt: timestamp('published_at', {}),
 });
 
