[Killed] EqualityOperator
src/domain/use-cases/resolve-authorization.use-case.ts:40:11
         throw new NotFoundException(`Authorization ${correlationId} not found`);
       }
 
-      if (decision === 'APPROVE') {
+      if (decision !== 'APPROVE') {
         request.approve(supervisorId);
       } else {
killedBy: ResolveAuthorizationUseCase con outbox (US-01) Persistencia + encolado en una sola TX la TX persiste la request y encola el outbox entry con shape AuthorizationResponseDto
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

- ObjectContaining {
+ Object {
    "correlation_id": "corr-abc",

[Killed] BlockStatement
src/domain/use-cases/resolve-authorization.use-case.ts:40:35
         throw new NotFoundException(`Authorization ${correlationId} not found`);
       }
 
-      if (decision === 'APPROVE') {
-        request.approve(supervisorId);
-      } else {
+      if (decision === 'APPROVE') {} else {
         request.reject(supervisorId);
       }
killedBy: ResolveAuthorizationUseCase con outbox (US-01) Persistencia + encolado en una sola TX ejecuta la resolución dentro de uow.transaction()
statusReason: TypeError: Cannot read properties of undefined (reading 'toISOString')

[Killed] BlockStatement
src/domain/use-cases/resolve-authorization.use-case.ts:42:14
 
       if (decision === 'APPROVE') {
         request.approve(supervisorId);
-      } else {
-        request.reject(supervisorId);
-      }
+      } else {}
 
       await ctx.authorizationRepository.save(request);
killedBy: ResolveAuthorizationUseCase con outbox (US-01) Payload del outbox según tipo de decisión incluye el status DISCOUNT cuando la decisión es REJECT en type REJECTED
statusReason: TypeError: Cannot read properties of undefined (reading 'toISOString')
