[Survived] StringLiteral
src/domain/use-cases/process-authorization-request.use-case.ts:12:40
 import { VerifyEmployeeBenefitUseCase } from './verify-employee-benefit.use-case';
 import { ProcessPriceChangeUseCase } from './process-price-change.use-case';
 
-export const VERIFY_EMPLOYEE_BENEFIT = 'VERIFY_EMPLOYEE_BENEFIT';
+export const VERIFY_EMPLOYEE_BENEFIT = "";
 export const PROCESS_PRICE_CHANGE = 'PROCESS_PRICE_CHANGE';
 

[Killed] ConditionalExpression
src/domain/use-cases/process-authorization-request.use-case.ts:28:9
   ) {}
 
   async execute(dto: AuthorizationRequestDto): Promise<void> {
-    if (dto.type === RequestType.EMPLOYEE_BENEFIT) {
+    if (false) {
       await this.verifyEmployeeBenefit.execute(dto);
       return;
killedBy: ProcessAuthorizationRequestUseCase — dispatch por tipo Cuando el tipo es EMPLOYEE_BENEFIT delega completamente en VerifyEmployeeBenefitUseCase
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"correlation_id": "corr-xyz", "created_at": "2026-06-11T22:48:24.781Z", "employee_id": "12345678-9", "pos_id": "pos-01", "store_id": "store-001", "type": "EMPLOYEE_BENEFIT"}

Number of calls: 0

[Killed] ConditionalExpression
src/domain/use-cases/process-authorization-request.use-case.ts:28:9
   ) {}
 
   async execute(dto: AuthorizationRequestDto): Promise<void> {
-    if (dto.type === RequestType.EMPLOYEE_BENEFIT) {
+    if (true) {
       await this.verifyEmployeeBenefit.execute(dto);
       return;
killedBy: ProcessAuthorizationRequestUseCase — dispatch por tipo Cuando el tipo es PRICE_CHANGE delega completamente en ProcessPriceChangeUseCase
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"correlation_id": "corr-xyz", "created_at": "2026-06-11T22:48:24.729Z", "employee_id": undefined, "original_price": 1000, "pos_id": "pos-01", "product_id": "prod-123", "requested_price": 600, "store_id": "store-001", "type": "PRICE_CHANGE"}

Number of calls: 0

[Killed] BlockStatement
src/domain/use-cases/process-authorization-request.use-case.ts:33:48
       return;
     }
 
-    if (dto.type === RequestType.PRICE_CHANGE) {
-      await this.processPriceChange.execute(dto);
-      return;
-    }
+    if (dto.type === RequestType.PRICE_CHANGE) {}
 
     const request = AuthorizationRequest.fromDto(dto);
killedBy: ProcessAuthorizationRequestUseCase — dispatch por tipo Cuando el tipo es PRICE_CHANGE delega completamente en ProcessPriceChangeUseCase
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"correlation_id": "corr-xyz", "created_at": "2026-06-11T22:48:25.125Z", "employee_id": undefined, "original_price": 1000, "pos_id": "pos-01", "product_id": "prod-123", "requested_price": 600, "store_id": "store-001", "type": "PRICE_CHANGE"}

Number of calls: 0

[Killed] ConditionalExpression
src/domain/use-cases/process-authorization-request.use-case.ts:33:9
       return;
     }
 
-    if (dto.type === RequestType.PRICE_CHANGE) {
+    if (true) {
       await this.processPriceChange.execute(dto);
       return;
killedBy: ProcessAuthorizationRequestUseCase — dispatch por tipo Cuando el tipo es DISCOUNT (no es EMPLOYEE_BENEFIT) guarda en repositorio y emite el evento hacia el supervisor con canal y payload correctos
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ObjectLiteral
src/domain/use-cases/process-authorization-request.use-case.ts:41:71
     const request = AuthorizationRequest.fromDto(dto);
     await this.repository.save(request);
 
-    await this.eventEmitter.emit(`store:${request.storeId}:requests`, {
-      id: request.id,
-      store_id: request.storeId,
-      pos_id: request.posId,
-      correlation_id: request.correlationId,
-      type: request.type,
-      amount: request.amount,
-      employee_id: request.employeeId,
-      status: request.status,
-      created_at: request.createdAt.toISOString(),
-    });
+    await this.eventEmitter.emit(`store:${request.storeId}:requests`, {});
   }
 }
killedBy: ProcessAuthorizationRequestUseCase — dispatch por tipo Cuando el tipo es DISCOUNT (no es EMPLOYEE_BENEFIT) guarda en repositorio y emite el evento hacia el supervisor con canal y payload correctos
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "store:store-001:requests", ObjectContaining {"correlation_id": "corr-xyz", "created_at": "2026-06-11T22:48:27.122Z", "pos_id": "pos-01", "status": "PENDING", "store_id": "store-001", "type": "DISCOUNT"}
Received: "store:store-001:requests", {}

Number of calls: 1
