[Killed] ConditionalExpression
src/domain/use-cases/process-price-change.use-case.ts:25:9
 
     const classification = PriceChangeClassifier.classify(originalPrice, requestedPrice);
 
-    if (classification === 'EQUAL') {
+    if (false) {
       await this.publisher.publish(`auth.response.${dto.store_id}`, {
         store_id: dto.store_id,
killedBy: ProcessPriceChangeUseCase Escenario EQUAL — precios iguales: auto-aprobación silenciosa publica APPROVED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "APPROVED", "type": "PRICE_CHANGE"}
Received: "auth.response.store-42", {"correlation_id": "corr-price-001", "pos_id": "pos-01", "resolved_at": "2026-06-11T22:48:25.733Z", "resolved_by": "SYSTEM", "status": "REJECTED", "store_id": "store-42

[Killed] BlockStatement
src/domain/use-cases/process-price-change.use-case.ts:25:37
 
     const classification = PriceChangeClassifier.classify(originalPrice, requestedPrice);
 
-    if (classification === 'EQUAL') {
-      await this.publisher.publish(`auth.response.${dto.store_id}`, {
-        store_id: dto.store_id,
-        pos_id: dto.pos_id,
-        correlation_id: dto.correlation_id,
-        status: AuthorizationStatus.APPROVED,
-        type: RequestType.PRICE_CHANGE,
-        resolved_by: 'SYSTEM',
-        resolved_at: new Date().toISOString(),
-      });
-      return;
-    }
+    if (classification === 'EQUAL') {}
 
     if (classification === 'WITHIN_LIMIT') {
killedBy: ProcessPriceChangeUseCase Escenario EQUAL — precios iguales: auto-aprobación silenciosa publica APPROVED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "APPROVED", "type": "PRICE_CHANGE"}
Received: "auth.response.store-42", {"correlation_id": "corr-price-001", "pos_id": "pos-01", "resolved_at": "2026-06-11T22:48:25.924Z", "resolved_by": "SYSTEM", "status": "REJECTED", "store_id": "store-42

[Survived] StringLiteral
src/domain/use-cases/process-price-change.use-case.ts:32:22
         correlation_id: dto.correlation_id,
         status: AuthorizationStatus.APPROVED,
         type: RequestType.PRICE_CHANGE,
-        resolved_by: 'SYSTEM',
+        resolved_by: "",
         resolved_at: new Date().toISOString(),
       });

[Killed] EqualityOperator
src/domain/use-cases/process-price-change.use-case.ts:38:9
       return;
     }
 
-    if (classification === 'WITHIN_LIMIT') {
+    if (classification !== 'WITHIN_LIMIT') {
       const request = AuthorizationRequest.fromDto(dto);
       await this.repository.save(request);
killedBy: ProcessPriceChangeUseCase Escenario WITHIN_LIMIT — diferencia ≤ 50 %: flujo normal de autorización llama a repository.save con una solicitud en estado PENDING
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/domain/use-cases/process-price-change.use-case.ts:38:9
       return;
     }
 
-    if (classification === 'WITHIN_LIMIT') {
+    if (true) {
       const request = AuthorizationRequest.fromDto(dto);
       await this.repository.save(request);
killedBy: ProcessPriceChangeUseCase Escenario EXCEEDS_LIMIT — diferencia > 50 %: rechazo inmediato + presencia física publica REJECTED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "REJECTED", "type": "PRICE_CHANGE"}

Number of calls: 0

[Killed] ObjectLiteral
src/domain/use-cases/process-price-change.use-case.ts:41:70
     if (classification === 'WITHIN_LIMIT') {
       const request = AuthorizationRequest.fromDto(dto);
       await this.repository.save(request);
-      await this.eventEmitter.emit(`store:${dto.store_id}:requests`, {
-        id: request.id,
-        store_id: request.storeId,
-        pos_id: request.posId,
-        correlation_id: request.correlationId,
-        type: request.type,
-        product_id: request.productId,
-        original_price: request.originalPrice,
-        requested_price: request.requestedPrice,
-        status: request.status,
-        created_at: request.createdAt.toISOString(),
-      });
+      await this.eventEmitter.emit(`store:${dto.store_id}:requests`, {});
       return;
     }
killedBy: ProcessPriceChangeUseCase Escenario WITHIN_LIMIT — diferencia ≤ 50 %: flujo normal de autorización emite al canal store:{store_id}:requests con los campos de precio para la app
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "store:store-42:requests", ObjectContaining {"correlation_id": "corr-price-001", "created_at": "2026-06-11T22:48:26.897Z", "original_price": 1000, "pos_id": "pos-01", "product_id": "prod-999", "requested_price": 600, "status": "PENDING", "store_id": "store-42", "type": "PRICE_CHANGE"}
Received: "store:store-42:requests", {}

Num

[Killed] ObjectLiteral
src/domain/use-cases/process-price-change.use-case.ts:57:67
     }
 
     // EXCEEDS_LIMIT
-    await this.publisher.publish(`auth.response.${dto.store_id}`, {
-      store_id: dto.store_id,
-      pos_id: dto.pos_id,
-      correlation_id: dto.correlation_id,
-      status: AuthorizationStatus.REJECTED,
-      type: RequestType.PRICE_CHANGE,
-      resolved_by: 'SYSTEM',
-      resolved_at: new Date().toISOString(),
-    });
+    await this.publisher.publish(`auth.response.${dto.store_id}`, {});
 
     await this.eventEmitter.emit(`store:${dto.store_id}:dispatches`, {
killedBy: ProcessPriceChangeUseCase Escenario EXCEEDS_LIMIT — diferencia > 50 %: rechazo inmediato + presencia física publica REJECTED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "REJECTED", "type": "PRICE_CHANGE"}
Received: "auth.response.store-42", {}

Number of calls: 1

[Killed] StringLiteral
src/domain/use-cases/process-price-change.use-case.ts:57:34
     }
 
     // EXCEEDS_LIMIT
-    await this.publisher.publish(`auth.response.${dto.store_id}`, {
+    await this.publisher.publish(``, {
       store_id: dto.store_id,
       pos_id: dto.pos_id,
killedBy: ProcessPriceChangeUseCase Escenario EXCEEDS_LIMIT — diferencia > 50 %: rechazo inmediato + presencia física publica REJECTED en Kafka con type PRICE_CHANGE
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "auth.response.store-42", ObjectContaining {"correlation_id": "corr-price-001", "status": "REJECTED", "type": "PRICE_CHANGE"}
Received: "", {"correlation_id": "corr-price-001", "pos_id": "pos-01", "resolved_at": "2026-06-11T22:48:26.939Z", "resolved_by": "SYSTEM", "status": "REJECTED", "store_id": "store-42", "type": "PRICE_CHAN
