[NoCoverage] BlockStatement
src/main.ts:7:28
 import { NestFactory } from '@nestjs/core';
 import { AppModule } from './app.module';
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule);
-  const port = process.env.PORT ?? 3001;
-  await app.listen(port);
-  console.log(`authorization-service running on port ${port}`);
-}
+async function bootstrap() {}
 
 void bootstrap();
