[Survived] StringLiteral
src/domain/ports/outbox-repository.port.ts:31:34
   oldestPendingAgeSeconds: number;
 }
 
-export const OUTBOX_REPOSITORY = 'OUTBOX_REPOSITORY';
+export const OUTBOX_REPOSITORY = "";
 
 export interface IOutboxRepository {
