[Killed] StringLiteral
src/domain/ports/authorization-repository.port.ts:4:41
 import { AuthorizationRequest } from '../entities/authorization-request.entity';
 import { AuthorizationStatus } from '@open-supervisor/shared-types';
 
-export const AUTHORIZATION_REPOSITORY = 'AUTHORIZATION_REPOSITORY';
+export const AUTHORIZATION_REPOSITORY = "";
 
 export interface IAuthorizationRepository {
killedBy: AuthorizationController GET /authorization/store/:storeId/pending — contrato del DTO (snake_case) devuelve los campos del request con nombres snake_case según AuthorizationRequestDto
statusReason: Error: Nest can't resolve dependencies of the AuthorizationController (ResolveAuthorizationUseCase, ?). Please make sure that the argument dependency at index [1] is available in the RootTestModule context.

Potential solutions:
- Is RootTestModule a valid NestJS module?
- If dependency is a provider, is it part of the current RootTestModule?
- If dependency is exported from a separate @Module, is
